[ {
  "id" : 460,
  "brand" : "cargo cosmetics edit",
  "name" : "Cargo Cosmetics Swimmables Water Resistant Blush",
  "price" : "22",
  "description" : "Cargo Cosmetics Swimmables Water Resistant Blush is a sweatproof, weatherproof blush has been tested by the make-up  artists for Dancing With The Stars on the latest live tour.It's longwearing formula  withstands moisture so you don’t have to fuss with re-application.  Specially formulated with a unique silicone-coated powder that provides  better adhesion to the skin and withstands water.     Features: Silicone coated pigments provide better adhesion to skin and withstand waterL-lysine , an amino acid found naturally in the skin, increases the  long wearing and water resistant properties because of its natural  affinity to skinShade Range: Ingredients: Talc, Octyldodecyl Stearate, Lauroyl Lysine, Dimethicone, Zinc Stearate,  Methicone, Sodium Benzoate, Sodium Dehydroacetate, Benzethonium  Chloride, Tocopheryl Acetate. May Contain: (+/-): Mica (CI 77019),  Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499),  Bismuth Oxychloride (CI 77163), Ultramarines (CI 77007), Manganese  Violet (CI 77742), Red 7 Lake (CI 15850:1), Red 30 Lake (CI 73360), Red  27 Lake (CI 45410), Yellow 5 Lake (CI 19140).",
  "category" : "powder",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/0909a58a190eceee8bd042d9fc80b047_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 459,
  "brand" : "mineral fusion",
  "name" : "Mineral Fusion Blush",
  "price" : "14.5",
  "description" : "Mineral Fusion Blush features luxuriously silky, triple-milled minerals that offer a natural flush of color to brighten the complexion and create a healthy, youthful glow. Includes a powerful blend of Pomegranate, White Tea, Red Tea and Sea Kelp, plus Vitamins C and E that defend skin against free radical damage for a healthy radiance. Free of Gluten, Parabens, Artificial Colors, Fragrances and Talc. Never-tested on animals. Hypo-allergenic.Ingredients: Mica, Zinc Stearate, Octyldodecyl Stearoyl Stearate, Titanium Dioxide (CI 77891), Caprylic/Capric Triglyceride, Tocopheryl Acetate (Vitamin E), Ascorbyl Palmitate (Vitamin C), Camellia Sinensis (White Tea) Leaf Extract, Aspalathus Linearis (Rooibos Red Tea) Leaf Extract, Punica Granatum (Pomegranate) Extract, Vitis Vinifera (Grape) Seed Extract, Laminaria Ochroleuca (Sea Kelp) Extract, Aloe Barbadensis (Aloe Vera) Extract, Lauroyl Lysine, Sambucus Nigra Fruit (Elderberry), Phenoxyethanol. MAY CONTAIN (+/-): Iron Oxides (CI 77491, 77492, 77499), Carmine (CI 75470), Ultramarine (CI 77007), Manganese Violet (CI 77742).",
  "category" : "powder",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f1c6dea6717aeaa8796a5f62992d8979_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 458,
  "brand" : "covergirl",
  "name" : "CoverGirl Clean Glow Blush ",
  "price" : "8.99",
  "description" : "Complete your Clean® look with a flush of lightweight, blendable color.  This versatile 3-in-1 multi-shade compact lets you customize your color  to create a radiant effect. Use just one color or all three!Features: 3-in-1 multi-shade compactLightweight, blendable flush of colorClean and natural lookHow to Apply:  Begin with the contour, or darkest, shade in your palette and apply to the hollow space below your cheekbones. Apply the medium shade to the apples of your cheeks and sweep upwards toward the hairline. For a youthful glow, highlight the tops of your cheeks with the lightest shade.",
  "category" : "powder",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/bb0b0c2057205b8e39823c5c7fc6af45_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 456,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Nude Wear Glowing Nude Blush",
  "price" : "20",
  "description" : "This natural, luxurious blush is so lightweight you'll never even feel it. Sheer coverage with a hint of luminosity delivers a lit-from-within blushing glow.Airy formula boosts skins natural luminosity, and allows skin’s natural radiance and color to shine through. A perfect blend of blush and complexion boosting tones brighten and enhance skin tone while adding a touch of naturally radiant color.Hypoallergenic. Fragrance-Free. Gluten Free. Paraben-Free. Non-Comedogenic. Dermatologist approved.",
  "category" : "powder",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/8df6f68abe9f6bf47546254706f54e37_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 453,
  "brand" : "revlon",
  "name" : "Revlon Powder Blush ",
  "price" : "13.49",
  "description" : "Revlon Powder Blush is an ultra-soft, silky powder blush adds a natural flush of color to your  cheeks and looks freshly applied all day. Enhance your complexion  instantly.Features:Provides a natural flush of colour with a soft satin finishEnhances cheekbones instantlyEasy to blend, buildable colourAvailable in 9 amazing shades",
  "category" : "powder",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/dd6ee943412a416ecfe9e4a1b2bed107_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 449,
  "brand" : "covergirl",
  "name" : "CoverGirl Cheekers Blush",
  "price" : "6.99",
  "description" : "Blush's basic rules—it has to be easy, and it has to look natural.  That's Cheekers. Each portable mini-compact gives you a sheer blush that  goes on to stay true, stay for hours. It's the way to glow!Features: Stays for hoursEasy and naturalDermatologically-tested",
  "category" : "powder",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/1d1668b02148a8823eb19c1ce4157a4e_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 447,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris True Match",
  "price" : "16.49",
  "description" : "True Match Blush flawlessly complements your skin's texture and tone and coordinates perfectly with True Match Makeup, Powder, and Concealer.Opti-Match technology creates uniquely true-to-life shades that flawlessly complement your skintone and undertone to perfection, leaving you with the most natural flush of colour imaginable.A unique Opti-BlendTM formula provides a skin-true texture that blends smoothly, never looks chalky or cakey.  Stays fresh and natural looking hour after hour.Oil-free, vitamin-rich, and non-comedogenic.",
  "category" : "powder",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e4e4827631b874f898d41a90ab3de5a6_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 446,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Happy Booster Glow & Mood Boosting Blush",
  "price" : "15.99",
  "description" : "Physicians Formula Happy Booster™ Glow & Mood Boosting Blush ultra-soft and blendable blushing powder features a fresh and vibrant mix of blushing tones infused with a pop of colour to create a healthy glow. Multi-reflective pearls provide a soft iridescence to highlight contour and add radiance to cheeks. Infused with our Happy Boost Blend, featuring Happy Skin and Euphoryl, natural plant extracts which have been shown to promote a feeling of happiness by mimicking the effect of Endorphins and helping protect the skin from environmental stress. The sweet scent of Violet provides a feeling of joy each time you apply!Directions for Use: Using a soft powder brush, sweep over entire palette to evenly blend colors. Tap excess powder from brush before applying. Brush over cheeks to define and contour or apply right below cheekbones for a more defined dramatic look.Ingredients: Talc. Zea Mays (Corn) Starch. Dimethicone. Octyldodecyl Stearoyl Stearate. Zinc Stearate. Pentaerythrityl Tetraisostearate. Astrocaryum Murumuru Seed Butter. Helianthus Annuus (Sunflower) Seed Oil. Lecithin. Phytosteryl Canolate. Plukenetia Volubilis Seed Oil. Rhodiola Rosea Root Extract. Rosmarinus Officinalis (Rosemary) Leaf Extract. Theobroma Grandiflorum Seed Butter. Schinus Terebinthifolius Seed Extract. Palm Alcohol. Phenoxyethanol. Potassium Sorbate. Fragrance. May Contain: Carmine. Iron Oxides. Manganese Violet. Mica. Red 6. Red 7 Lake. Red 28 Lake. Red 30 Lake. Titanium Dioxide. Ultramarines. Yellow 5 Lake.Hypoallergenic. Non-comedogenic. Paraben-free. Dermatologist approved.​",
  "category" : "powder",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/cd18303ddee33a8e03e0ad53f51e38f1_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 445,
  "brand" : "pure anada",
  "name" : "Pure Anada Loose Mineral Luminous Blush",
  "price" : "12.0",
  "description" : "Impart a healthy glow, with a Pure Anada luminous mineral blush!Learn how to make your own custom lip balm using your favourite shade with our easy DIY Lip Balm recipe on our blog, The Well!Shade Range: Ingredients: Mica,  Iron Oxides, Ultramarines, May contain: Titanium Dioxide",
  "category" : "powder",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/187a238fb2afe03f3f7d0133305d845a_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 444,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Mineral Wear Airbrushing Blush",
  "price" : "15.49",
  "description" : "Physicians Formula Mineral Wear Airbrushing Blush is an ultra-fine mineral blush delivers a radiant pop of color with a flawless airbrushed finish.Directions: Buff on blush over cheekbones to define and contour or apply right below  cheekbones for amore defined and dramatic look. For the most even  application, be sure to tap excess powder from brush before applying.Ingredients: Mica, Boron Nitride, Zinc Stearate, Lauroyl Lysine, Tricaprylin,  Magnesium Silicate, Camellia Oleifera Leaf Extract, Chamomilla Recutita  (Matricaria) Flower Extract, Ginkgo Biloba Leaf Extract, Panax Ginseng  Root Extract, Carthamus Tinctorius (Safflower) Seed Oil, Tocopheryl  Acetate, Retinyl Palmitate, Ascorbyl Palmitate, Chlorphenesin, Potassium  Sorbate, Sodium Dehydroacetate, May Contain: Iron Oxides, Titanium  Dioxide, Zinc OxideHypoallergenic. Fragrance-Free. Paraben-Free. Gluten Free.  Dermatologist approved. Non-Comedogenic.",
  "category" : "powder",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e096eb4264561b76a90a9a2bfb6cfca2_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 443,
  "brand" : "covergirl",
  "name" : "CoverGirl Instant Cheekbones Contouring Blush",
  "price" : "7.99",
  "description" : "Cheekbones blush",
  "category" : "powder",
  "rating" : 3.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5361038d5de79bedaca6c64b48271161_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 442,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Happy Booster Glow & Mood Boosting Powder",
  "price" : "19.99",
  "description" : "Physicians Formula Happy Booster™ Glow & Mood Boosting Powder is an ultra-smooth, perfecting powder in a complementary palette of colour. It blends together to even out skin tone with a flawless radiance. Vibrant pink heart gives cheeks a healthy pop of colour. Infused with our Happy Boost Blend, featuring Happy Skin and Euphoryl, natural plant extracts which have been shown to promote a feeling of happiness by mimicking the effect of Endorphins and helping protect the skin from environmental stress. The sweet scent of Violet provides a feeling of joy each time you apply.Directions for Use: May be worn alone or over makeup. Blend all shades together and brush on powder evenly over face and neck to even out skin tone with a happy glow. For an extra pop of color, sweep brush over the pink heart and apply on cheeks. For best results on dry to very dry skin, apply moisturizer prior to using powder.Ingredients: Talc. Zea Mays (Corn) Starch. Dimethicone. Octyldodecyl Stearoyl Stearate. Pentaerythrityl Tetraisostearate. Astrocaryum Murumuru Seed Butter. Helianthus Annuus (Sunflower) Seed Oil. Lecithin. Phytosteryl Canolate. Plukenetia Volubilis Seed Oil. Rhodiola Rosea Root Extract. Rosmarinus Officinalis (Rosemary) Leaf Extract. Theobroma Grandiflorum Seed Butter. Schinus Terebinthifolius Seed Extract. Palm Alcohol. Phenoxyethanol. Potassium Sorbate. Fragrance. May Contain: Carmine. Iron Oxides. Manganese Violet. Mica. Red 6. Red 7 Lake. Red 28 Lake. Red 30 Lake. Titanium Dioxide. Ultramarines. Yellow 5 Lake.Hypoallergenic. Paraben free. Dermatologist approved. Non-Comedogenic.",
  "category" : "powder",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f79082caeb5359d5927f1a4a0aecf3b8_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 441,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Blush Palette Light",
  "price" : "9.99",
  "description" : "This beautiful blush palette holds 4 gorgeous shades to mix and match  throughout the year for a custom blended color. Great for contouring,  shading, sculpting, and highlighting, these silky smooth blushes create a  beautiful pigmented glow. With a mixture of complimentary matte and  shimmer finishes, you can achieve a professional look every time.Ingredients: Mica, Talc, Ethylhexyl Palmitate, Silica, Nylon-12, PTFE, Zince Stearate, Dimethicone, Tocopheryl Acetate (Ve). MAY CONTAIN: Titanium Dioxide (CI 77891), Iron OXides (CI 77491,  CI 77492, CI 77499), Red 7 Lake (CI 15850), Ultramarines (CI 77007), Red  6 Lake (CI 15850), Red 28 Lake (CI 45410).",
  "category" : "powder",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/9afdb02a47f0a04fe1f7aa78c5a49f63_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 440,
  "brand" : "pure anada",
  "name" : "Pure Anada Loose Mineral Velvet Matte Blush ",
  "price" : "12.0",
  "description" : "Pure Anada Loose Mineral Velvet Matte Blush gives your cheeks a soft sweep of subtle color. Comes packaged in a 3 g sifter jar. Shade Range: Ingredients: Mica, Calcium Carbonate, Iron Oxides, Ultramarines, May contain: Titanium Dioxide",
  "category" : "powder",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/47169d3a86232fa7eec3a0c43ed1ad06_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 439,
  "brand" : "maybelline",
  "name" : "Maybelline Fit Me Blush",
  "price" : "10.29",
  "description" : "Maybelline Fit Me Blush has lightweight pigments blend easily and wear evenly. It provides a natural, fade-proof cheek color that leaves skin the way it was meant to be...fresh, breathing, and natural.  For Best Results: For soft, natural look, brush along cheekbone, sweeping upward.",
  "category" : "powder",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/53d5f825461117c0d96946e1029510b0_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "blush"
}, {
  "id" : 437,
  "brand" : "pure anada",
  "name" : "Pure Anada Pressed Mineral Cheek Colour Pan",
  "price" : "30",
  "description" : "Pure Anada is pleased to bring you a lovely selection of convenient pressed mineral colors!    You’ll love the silky texture and longevity of these highly wearable cheek colors.Mineral pigments and organic Jojoba are pressed together to create a natural makeup product. You can have confidence that you are making a beautiful, healthy choice!Pure Anada pressed colors are designed to be inserted into customizable magnetic compacts like the Pure Ananda Reusable Magnetic Compact. Design your own palette!  Shades:Ingredients: Mica (CI 77019), Iron Oxides (CI 77492, CI 77499) Calcium Carbonate, Caprylic Triglyceride *Simmondsia Chinensis (Jojoba seed oil) Ultramarines (CI 77007), Titanium Dioxide (CI 77891) * Certified Organic IngredientVegan, Gluten Free, Non-GMO, Dairy Free, Peanut Free, Natural",
  "category" : "powder",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/43071cd57ecffc55c1e0bff29278c3a7_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 436,
  "brand" : "milani",
  "name" : "Milani Rose Powder Blush",
  "price" : "9.99",
  "description" : "Now this is a blush that deserves to be seen! Gorgeous in the compact, even prettier on cheeks, this petal soft, natural-finish powder shapes, contours and highlights. Streaks? Never. Easy to use? Always. In ultra-flattering shades that you just can’t live without.Features:Real rose petals are crushed and micro-milled into the powder to naturally enhance every skin toneEasy to use, streak-free, shapes & contoursSuitable for all skin typesMade in ItalyStreak-freeApplication: Glide a brush through the color and lightly tap off excess powder. Lightly apply to cheeks, forehead, chin and/or nose and blend well for a soft glow. Ingredients:  Talc, Synthetic Wax, Aluminum Starch, Octenylsuccinate, Hydoxylated Lanolin, Isopropyl Lanoate, Petrolatum, Cyclomethicone,, Lanolin Alcohol, Cetyl Actate, Acetylated Lanolin Alcohol, Methylparabne, Proprylparaben. +/- May Contain: Synthetic Flourphlogopite, Mica, Tin Oxide, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Yellow 5 (CI 19140), Red 7 (CI 15850), Red 28 (CI 45410), Red 36 (CI 12085), Blue 1 (CI 42090), Carmine (CI 75470), Ultamarines (CI 77007), Ferric Ferrocyanide (CI 77510), Manganese Violet (CI 77742).",
  "category" : "powder",
  "rating" : 4.6,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4c9db52b5d1cf54fe74fc60b00ffdaa1_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "blush"
}, {
  "id" : 435,
  "brand" : "milani",
  "name" : "Milani Baked Blush",
  "price" : "7.99",
  "description" : "This silky blush with benefits can be used so many ways. It shapes, it contours, it highlights. Sunbaked on Italian terracotta tiles, it’s buildable from sheer to vibrant. Yes, it adds a cheeky pop of colour to your complexion. Radiance and warmth, too.Features:Multi-purpose: shapes, contours and highlights cheeksEasy to use for a perfect radiant finishMirror & brush applicator includedStreak-freeBuildable from sheer to vibrantApplication: Glide brush through color and lightly tap off excess powder. Lightly apply to cheeks, forehead, chin and/or nose and blend well for a soft glow.Ingredients: Talc, Mica, Glyceryl Ethylhexanoate/Stearate/Adipate, Dimethicone, Octyldodecyl Stearoyl Stearate, Isopropyl Myristate, Polyacrylamide, C13-14 Isoparaffin, Laureth-7, Sorbitan Stearate, Zea Mays (Corn) Starch, Lauroyl Lysine, Magnesium Aluminum Silicate, Cetearyl Ethylhexanoate, Sodium Dehydroacetate, Nylon-12, Imidazolidinyl Urea, Methylparaben, Silica, Ethylparaben, Propylparaben, Butylparaben, Titanium Dioxide (CI 77891), Iron Oxide (CI 77491). +/- May Contain: Iron Oxide (CI 77492, CI 77499), Yellow 5 (CI 19140), Red 7 (CI 15850), Yellow 6 (CI 15985), Carmine (CI 75470), Ultramarines (CI 77007). Shade Range:",
  "category" : "powder",
  "rating" : 4.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4ae353dcae46e9b97c4915566fc9190a_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "blush"
}, {
  "id" : 434,
  "brand" : "cargo cosmetics",
  "name" : "Cargo Cosmetics Blush",
  "price" : "26.0",
  "description" : "A favorite with make-up artists Cargo's blendable and easy to wear blush  offers a stunning array of shades from ranging from delicate neutrals to  vibrant corals and pinks. Cargo blush is created with a moist and sheer  powder formulation that glides easily over the skin for a beautiful,  natural flush. The silky smooth texture layers well for added intensity  as desired.  The pro formulation also offers longwearing and stay true  color. Generously packaged in Cargo's oversized signature tin allowing for  easy access with professional brushes.     Features: Silky smooth texture that layer well for added intensity as desiredLongwearing and stay true colorGenerously packaged in Cargo's oversized signature tin allowing for easy access with professional brushesShade Range: Cargo Cosmetics Blush is one of our 10 Makeup Must Haves.  See the full list on The Well.  Ingredients: Talc, Zinc Stearate, Boron Nitride, Octyldodecyl Stearate, Octyldodecyl  Stearoyl Stearate, Phenoxyethanol, Silica, Tocopheryl Acetate, Caprylyl  Glycol, Carthamus Tinctorius Seed Oil, Sorbic Acid, Aloe Barbadensis  Leaf Extract. May Contain (+/-): CI 77019 (Mica), CI 77891  (Titanium Dioxide), CI 15850 (Red 7 Lake), CI 15850 (Red 6 Lake), CI  15985 (Yellow 6 Lake), CI 77491 (Iron Oxides), CI 77499 (Iron Oxides),  CI 77492 (Iron Oxides), CI 77742 (Manganese Violet), CI 77007  (Ultramarines).",
  "category" : "powder",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b684853d1ee1ffd6125cdbb0308cb9c7_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 429,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Argan Wear Ultra-Nourishing Argan Oil Blush in Rose",
  "price" : "15.99",
  "description" : "Physicians Formula Argan Wear Ultra-Nourishing Argan Oil Blush is an exotic blush infused with 100% Pure Argan Oil.Features: Argan  oil that help transform skin, smoothing fine lines, brightening dull  skin and renewing suppleness, helping to enhance skin's youthful glowHypoallergenicGluten & Paraben freeNon-comedogenicDermatologist approvedDirections: Sweep  brush over entire palette to evenly blend colors.  Tap excess powder  from brush before applying.  Brush over cheekbones to define and contour  or apply right below cheekbones for a more defined and dramatic look.Ingredients: Talc,  Mica, Isostearyl Neopentanoate, Argania Spinosa (Argan) Kernel Oil,  Polybutene, Ascorbyl Palmitate, C12-15 Alkyl Benzoate, Calcium Sodium  Borosilicate, Citric Acid, Fragrance, Glyceryl Oleate, Glyceryl  Stearate, Isopropyl Isostearate, Lecithin, Tin Oxide, Tocopherol,  Caprylyl Glycol, Hexylene Glycol, Phenoxyethanol. May Contain: Iron  Oxides, Titanium Dioxide, Red 6, Red 7, Ultramarines, Yellow 5 Lake.",
  "category" : "powder",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/7c674b3490001af91546b73c5fc45f94_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 420,
  "brand" : "nyx",
  "name" : "NYX Rouge Cream Blush",
  "price" : "9.99",
  "description" : "NYX Rough Cream Blush is a long-lasting, sheer blusher color in a velvety smooth cream.Features:Provides radiant, long-lasting color and a fresh, dewy glowFormula is infused with minerals that hydrate and condition the skinLong-lasting color in the form of a velvety smooth cream",
  "category" : "cream",
  "rating" : 2.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/7e559a82a8c8b56d75ae5f108d8449ba_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "blush"
}, {
  "id" : 417,
  "brand" : "revlon",
  "name" : "Revlon PhotoReady Cream Blush",
  "price" : "13.49",
  "description" : "Revlon PhotoReady™ Cream Blush was  created by Global Artistic Director Gucci Westman for the Spring 2012  collection. Inspired by the glowing skin of a beach beauty, these silky  cream blushes glide on smoothly provide a dewy flush of color for a  healthy, gorgeous glow.Features: Creamy blush provides buildable, beautiful flush of colorLightweight formula with silky soft feel on skinBlends evenly over cheeks for smooth applicationPhotochromatic pigments bend and reflect light to provide cheeks with a beautiful glow",
  "category" : "cream",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/1b84cb453bc5527d4ecb11b5967cd135_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 416,
  "brand" : null,
  "name" : "DaLish Lip Cheek Balm",
  "price" : "15.0",
  "description" : "A little goes a long way with this richly pigmented multi-use balm that can be used on cheeks and lips for a fresh, happy glow. Start with one dab of DaLish Lip Cheek Balm on the apples of cheeks and use your fingers to massage in colour where you want it. Pearl-like pigments means the pretty tint won’t fall flat on lips. Directions: Apply directly on to lips for balm use and dab directly onto cheeks for blush use. Blend woth your fingers till you reach your desired look. Shade Range:  BO1 - Dusty Rose – shade with a hint of bronzer. Perfect for fair to medium tones.                                                                                                                                                                                                                                                            BO2 - Coral – that has a real punch to it. Perfect for all skin tones.                                                                                                                                                                                                                                                            BO3 - Bubble Gum Pink – Has a great pop of colour and perfect for all skin tones.                                                                                                                                                                                                                                                            BO4 - Bronzer – Perfect for all colour tones and ideal for contouring.                                                                                                                                                                                                                                                            BO5 - Deep Plum – Perfect for all skin tones. - See more at: //www.dalishcosmetics.com/product/lipcheek-balms-75-natural#sthash.9DGfyyKW.dpufBO1 - Dusty Rose – shade with a hint of bronzer. Perfect for fair to medium tones.BO2 - Coral – that has a real punch to it. Perfect for all skin tones.BO3 - Bubble Gum Pink – Has a great pop of colour and perfect for all skin tones.BO4 - Bronzer – Perfect for all colour tones and ideal for contouring.BO5 - Deep Plum – Perfect for all skin tones.Ingredients: Ricinus Communis (Castor) Seed Oil, Caprylic/Capric Triglycerides, Copernicia Cerifera (Carnauba) Wax, Cetyl Alcohol, Hydrogenated Castor oil, Cetyl Palmitate, Beeswax, Sorbitan Palmitate, Sorbitan Olivate, Helianthus Annuus (Sunflower) Seed Oil, Rosmarinus officinalis (Rosemary) Leaf Extract, Benzyl Alcohol, Benzoic Acid, Dehydroacetic Acid, Sorbic Acid, Tocopherol, Vanillin, May contain (+/-), Titanium Dioxide CI 77891, Iron Oxides CI 77491, Mica CI 77019, Red 7 Lake CI 15850, Yellow 5 Lake CI 19140, Red 27 Lake CI 45410, Red 30 Lake CI 73360, Blue 1 Lake CI 42090, Carmine CI 75470. *Contains natural Antioxidant Contains organic castor oil and Carnauba Wax ",
  "category" : "cream",
  "rating" : 2.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/3a23201f66be485784f542c43a4b3569_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 415,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Super BB All-in-1 Beauty Balm Cheek & Lip in Berry Pink",
  "price" : "8.99",
  "description" : "Physicians Formula Super BB All-in-1 Beauty Balm Cheek & Lip in Berry Pink is a great mulch-purpose product to pop into your purse. Features: HypoallergenicParaben, Gluten & Fragrance freeNon-comedogenicDermatologist approvedDirections: Apply desired amount to cheeks & lips and blend with fingertip or brush.  Reapply as needed.Ingredients: Caprylic/Capric Triglyceride, Polyethylene, Silica, Dimethicone, Hydrogenated Polyisobutene, Phenylpropyldimethylsiloxysilicate, Octyldodecanol, Euphorbia Cerifera (Candelilla) Wax, Hydrogenated Coco-Glycerides, Propylene Glycol Ricinoleate, Copernicia Cerifera (Carnauba) Wax, Mica, Calcium Aluminum Borosilicate, Flavor, Perilla Ocymoides Seed Oil, Salix Alba (Willow) Bark Extract, BHT, Glycerin, Lysolecithin, Polysilicone-11, Tin Oxide, Tocopheryl Acetate, Triethoxycaprylylsilane, Water, Phenoxyethanol. May Contain: Titanium Dioxide, Orange 5 Lake, Red 6 Lake, Red 7 Lake, Red 28 Lake, Red 30 Lake.",
  "category" : "cream",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/468d19513d1f01f1e59806ccdd4222fe_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "blush"
}, {
  "id" : 414,
  "brand" : "maybelline",
  "name" : "Maybelline Dream Bouncy Blush",
  "price" : "11.99",
  "description" : "Now, blush has bounce! Freshest flush ever:• New bouncy texture is formulated with silicone elastomers• Lightweight like a powder, yet melts seamlessly into skin like a cream giving you a fresh flush• Dermatologist tested• Allergy tested• Non-comedogenic                                                                                                                 For best results: With your fingertips, blend a small amount of  blush onto the apples of your cheeks, applying from your cheekbones to  your temples. To build colour intensity, apply more blush.",
  "category" : "cream",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/51eacb9efebbaee39399e65ffe3d9416_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "blush"
}, {
  "id" : 412,
  "brand" : "revlon",
  "name" : "Revlon Colorstay Moisture Stain",
  "price" : "12.99",
  "description" : "Revlon Colorstay Moisture Stain offers a new level of glossy wet color!It gives you saturated lips with brilliant shine and vivid colorFeatures:Drenches lips in glossy wet colorUltra-light creamy lipstain with Vitamin E and Aloe 88% of women felt lips were instantly moisturized without stickiness",
  "category" : "lip_stain",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/df00e1e6268dc7d208b993d5692c9772_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 411,
  "brand" : "revlon",
  "name" : "Revlon ColorBurst Balm Stain",
  "price" : "11.49",
  "description" : "Revlon ColorBurst Balm Stain is a pampering balm fused with a  lightweight lipstain in an adorable chubby crayon. Revlon ColorBurst Balm Stain gives softer, smoother lips with a perfect flush of color  that lasts hour after hour. The gel formula  comes in 12 vibrant shades that match any look or mood and the crayon is retractable so no sharpener is needed!      Expert Tips: Step 1 - Apply Revlon ColorBurst Balm Stain evenly to clean, bare lips. Build color and coverage as desired. Step 2 - Reapply as desired for moisturizing shine throughout the day.Revlon Just Bitten Kissable Balm Stain is one of our 10 Makeup Must Haves.  See the full list on The Well. ",
  "category" : "lip_stain",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/cf54199ffb803951bf6342b59e3c58a5_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 410,
  "brand" : "wet n wild",
  "name" : "Wet n Wild Mega Slicks Lip Balm Stain",
  "price" : "3.99",
  "description" : "Now you can amp up your lips with one stick for a kissable pout in no  time.To keep you pucker-perfect, these all lip balm stains glide on  smoothly while conditioning the lips. Enriched with Acai Palm Oil, this  amazing formula forms a protective shield on the lips to prevent  feathering. Complete with six great shades and continuous moisture, the  formula leaves the lips with a unique minty, cooling sensation. No  matter how long the kiss, this balm will last and last.",
  "category" : "lip_stain",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/be634f08e36f3a6f18feed1c68065596_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 389,
  "brand" : "marcelle",
  "name" : "Marcelle BB Cream-to-Powder Makeup",
  "price" : "22.99",
  "description" : "A perfect addition to Marcelle's best skin enhancing line, Marcelle BB Cream-to-Powder Makeup has a creamy texture at first touch, but transforms to a  silky, powdery finish upon contact with the skin. Its practical compact  with mirror and sponge built-in is ideal for all-day touch-ups to  maintain a perfect and even skin. Can be used alone or over the BB Cream  for more coverage.  Hypo-allergenic and perfume-free. Paraben free, oil free, and non-comedogenic. Shade Range:",
  "category" : "cream",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4ca356be704dce025868182946e52080_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 388,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Super BB All-in-1 Beauty Balm Stick",
  "price" : "12.99",
  "description" : "Physicians Formula Super BB All-in-1 Beauty Balm Stick is a concealer, and foundation touch up tool. It's ideal for perfecting, concealing, smoothing, brightening, moisturizing, protecting, firming, priming+filling and line softening.Features: HypoallergenicParaben, gluten and fragrance freeNon comedogenicDermatologist approvedDirections: Apply the stick directly onto face starting at the center and blending outward using fingertips.  Layer for additional coverage.Ingredients: Phenyl Trimethicone, Dimethicone, Caprylic/Capric Triglyceride, Isocetyl Stearate, Euphorbia Cerifera (Candelilla) Wax, Mica, Microcrystalline Wax, Cetyl Ethylhexanoate, Polymethylsilsesquioxane, Copernicia Cerifera (Carnauba) Wax, Butyrospermum Parkii (Shea) Butter, Ethylhexyl Palmitate, Synthetic Beeswax, Calcium Aluminum Borosilicate, Phenoxyethanol, Salix Alba (Willow) Bark Extract, Perilla Ocymoides Seed Oil, Ascorbyl Palmitate, Tetrahexyldecyl Ascorbate, Tocopheryl Acetate, Arachidyl Alcohol, BHT, Castor Oil Phosphate, Cetyl PEG/PPG-101-10/1 Dimethicone, Glycerin, HDI/Trimethylol Hexyllactone Crosspolymer, Hexyl Laurate, Lysolecithin, Ozokerite, Palmitic Acid, Polyglyceryl-2 Isostearate, Silica, Stearic Acid, Triethoxycaprylylsilane, Water. May Contain: Iron Oxides, Titanium Dioxide.",
  "category" : "cream",
  "rating" : 2.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4d7d79376ed827d7e587d849e16f2136_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 387,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Nude Wear Touch of Glow Stick in Nude Glow",
  "price" : "12.99",
  "description" : "Physicians Formula Nude Wear Touch of Glow Stick is an all-around concealer, foundation, and highlighter touch up tool. The lightweight, glide on formula helps erase the appearance of imperfections and restore the glow of natural, naked skin.Features: Vanishes dark circles, fine lines, shadows and signs of fatigueHypoallergenicGluten, Fragrance, Paraben & Oil freeDermatologist approvedDirections: Apply all over face or to any imperfection and gently blend with fingertip to even out skin tone.Ingredients: Phenyl Trimethicone, Dimethicone, Caprylic/Capric Triglyceride, Isocetyl Stearate, Euphorbia Cerifera (Candelilla) Wax/Cire de Candelilla, Mica, Microcrystalline Wax/Cire Microcristalline, Ceryl Ethylhexanoate, Polymethylsilsesquioxane, Butryospermum Parkii (Shea) Butter, Copernicia Cerifera (Carnauba) Wax/Cire de Carnauba, Synthetic Beeswax, Ethylhexyl Palmitate, Calcium Aluminum Borosilicate, Phenoxyethanol, Lactic Acid, Nylon-12, HDI/Trimethylol Hexyllactone Crosspolymer, Lauroyl Lysine, Synthetic Fluorphlogopite, Boron Nitride, Silica, Arachidyl Alcohol, Cetyl PEG/PPG-10/1 Dimethicone, Hexyl Laurate, Ozokerite, Palmitic Acid, Polyglyceryl-2 Isostearate, Stearic Acid, BHT, Ascorbyl Palmitate, Tetrahexyldecyl Ascorbate,  Tocopherol Acetate. May Contain/Peut Contenir: Iron Oxides, Titanium Dioxide.",
  "category" : "cream",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/2f58780bf027e35f8f354a8f9b7acc3e_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 386,
  "brand" : "covergirl",
  "name" : "CoverGirl & Olay Simply Ageless Foundation ",
  "price" : "15.99",
  "description" : "This breakthrough formula with Olay Regenerist Serum and SPF 22 stays  suspended over fine lines and wrinkles, unlike the leading anti-aging  department store foundation that can gather in wrinkles and make skin  look older. Clinically shown to provide significant improvement in skin  condition in just four weeks.Features: SPF 22Stays suspended over fine lines and wrinklesEven coverageDermatologically-tested",
  "category" : "cream",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/fd47eaa9241a010e48fc32cf4611d772_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 385,
  "brand" : "sante",
  "name" : "Sante Soft Cream Foundation",
  "price" : "27.49",
  "description" : "Sante soft cream foundation has precious mineral pigments for a  velvety, especially flawless complexion. Gives your skin a fresh,  pleasant feel with cupuacu butter, pomegranate extract and valuable  organic jojoba oil. Free of paraffin and silicone oils. Colours: Ingredients: AQUA (WATER), HYDROGENATED VEGETABLE OIL, GLYCINE SOJA (SOYBEAN) OIL*, GLYCERIN, SIMMONDSIA CHINENSIS (JOJOBA) SEED OIL*, SQUALANE, TALC, POTASSIUM CETYL PHOSPHATE, PALMITIC ACID, STEARIC ACID, PARFUM (ESSENTIAL OILS), HYDROGENATED PALM GLYCERIDES, THEOBROMA GRANDIFLORUM SEED BUTTER*, PUNICA GRANATUM SEED EXTRACT*, SORBITOL, GALACTOARABINAN, XANTHAN DUM, HYDROGENATED LECITHIN, SODIUM CITRATE, ASCORBYL PALMITATE, LECITHIN, CITRIC ACID, TOCOPHEROL, HYDROGENATED PALM GLYCERIDES CITRATE, FARNESOL, [+/- CI 77891 (TITANIUM DIOXIDE), CI 77492 (IRON OXIDES), CI 77491 (IRON OXIDES)] * organically grown",
  "category" : "cream",
  "rating" : 3.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e468ef6f9534484e1f21e0f971d92c48_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 384,
  "brand" : "covergirl",
  "name" : "CoverGirl Ultimate Finish Liquid Powder Makeup ",
  "price" : "9.99",
  "description" : "Get the beauty of a liquid, a powder and concealer in one makeup!  Ultimate Finish glides on weightlessly to cover and conceal where you  need it, then dries to the soft finish of a powder. For an ultimate  natural look—beautiful and wondrous. It's all you need—all in one!Features: Oil and fragrance freeHypoallergenicDermatologically-tested",
  "category" : "cream",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/1aa7e9e399d24c2a747137df51026ed2_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 383,
  "brand" : "revlon",
  "name" : "Revlon Colorstay Whipped Creme Makeup",
  "price" : "19.99",
  "description" : "Finally, truly decadent makeup offers  ultimate performance. The mousse-like texture of Revlon Colorstay Whipped Creme Makeup feels like silk on your  skin. And, the time release formula balances skin for a flawless look.  All day flexible wear without flaking, caking or feeling heavy.Features: Buildable to full coverage for flawless skin Soft, matte finish all day long Withstands heat and humidity – great for summer",
  "category" : "cream",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/037b446c36900da96e12fde1be625a76_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 382,
  "brand" : "maybelline",
  "name" : "Maybelline Dream Smooth Mousse Foundation",
  "price" : "14.79",
  "description" : "Why You'll Love ItUnique cream-whipped foundation provides 100% baby-smooth perfection.  Skin looks and feels hydrated for 14 hours - never rough or dry Lightweight formula provides perfectly moisturizing coverage Blends seamlessly and feels fresh all-day Oil-free, Fragrance-free, Dermatologist Tested, Allergy Tested, Non-comedogenic – won’t clog pores. Safe for sensitive skin   ",
  "category" : "cream",
  "rating" : 3.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/fb79e7facf701176d4113527c284613f_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 381,
  "brand" : "revlon",
  "name" : "Revlon New Complexion One-Step Makeup",
  "price" : "18.29",
  "description" : "Give your skin a bright, natural looking finish in one easy step! This creamy formula combines the coverage of a liquid with the finish of a powder for a natural, even finish. Formulated with a special mineral complex to naturally brighten your skin it offers perfect, long-lasting coverage with SPF 15 protection.",
  "category" : "cream",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/3b9b3cd1bce690e330f335cd696bb098_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 380,
  "brand" : "maybelline",
  "name" : "Maybelline Fit Me Shine-Free Foundation Stick",
  "price" : "10.99",
  "description" : "Get flawless, shine-free skin instantly and on-the-go for tailor-made  mattifying coverage.  The anti-shine core has ultra-lightweight powders  built in to the stick foundation to instantly dissolve excess oil. Features: Maybelline's first gel stick foundation with an anti-shine core Fresh gel foundation blends to a flawless matte finish Lightweight powders in the anti-shine core instantly dissolve excess oil",
  "category" : "cream",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/d04e7c2ed65dabe1dca4eed9aa268e95_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 379,
  "brand" : "maybelline",
  "name" : "Maybelline Dream Matte Mousse Foundation",
  "price" : "14.79",
  "description" : "Maybelline Dream Matte Mouse Foundation is a revolutionary air-soft mousse that provides perfecting coverage for 100% velvet-matte complexion. It's non-comedogenic, fragrance-free, dermatologist-tested, allergy-tested and ideal for normal to oily skin.For best results: Apply smoothly and evenly to your face and blend with your fingertips.﻿   ",
  "category" : "cream",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/029889b345c76a70e8bb978b73ed1a87_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 378,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio HD Mattifying Cream Foundation",
  "price" : "9.99",
  "description" : "This high-definition, oil-free, lightweight foundation is perfect for  normal to oily skin types. The cream-to-powder formula minimizes fine  lines and leaves a natural, long-lasting, matte finish. Includes a  compact sponge for easy application and portable beauty.Shade Range: Ingredients: Ethylhexl Palmitate, Octyldodecanol, Synthetic Wax, Copernicia Cerifera  (Carnauba) Wax, Caprylic/Capric Triglyceride, Tridecyl Trimellitate,  Mica, Nylon-12, Silica, Triacontanyl PVP, Polyglyceryl-4 Isostearate,  Propylparaben, Tocopheryl Acetate MAY CONTAIN: Iron Oxides (CI  77491, CI 77492, CI 77499), Manganese Violet (CI 77492), Red No. 33 Lake  (CI 17200), Blue No. 1(CI 42090), Yellow No. 5 Lake (CI 19140),  Titanium Dioxide (CI 77891), Red No.40 Lake (CI 16035), Chromium  Hydroxide Green (CI 77289).",
  "category" : "cream",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b9a2310c06b11611ab850051c90d06b0_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 374,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Mineral Wear Talc-Free All-In-One ABC Cushion Foundation",
  "price" : "20.49",
  "description" : "1st Ever Mineral ABC Cushion Foundation! Weightless mineral formula provides the multi-tasking benefits of an alphabet cream with the gentle, flawless, skin-perfecting effects of minerals. Revolutionary cushion foundation instantly corrects visible imperfections, blurs fine lines and pores with a perfected airbrushed finish.ABC Cushion Technology: Ultra-fluid, lightweight formula delivers an instantly smoothing & firming effect, while hydrating skin for effortless perfection. Unique cushion sponge delivery system dispenses the perfect dose. Each tap delivers customizable light to medium coverage.Features:Featuring a proprietary ABC blend of complexion enhancing minerals, soothing plant extracts, smoothing antioxidants and skin nourishing vitamins for moisturizing & brightening benefits that leave skin with a luminous finishLuxurious puff applicator provides a cooling & skin refreshing finish upon applicationUltra-convenient for on-the-go!Directions: Apply pressure onto cushion with puff applicator to release the perfect dose of foundation for customizable light to medium coverage. Gently pat puff onto skin. Flip cushion for extended foundation usage. Close inner lid tightly to prevent product from drying out. Ingredients: Mineral Water, Ethyl Macadamiate, Cyclopentasiloxane, Dimethicone, Zinc Oxide, Cyclohexasiloxane, Cetyl PEG/PPG-10/1 Dimethicone, Butylene Glycol, Mica, Calcium Aluminum Borosilicate, Polyethylene, Polyglyceryl-4 Isostearate, Water/Eau, PEG/PPG-18/18 Dimethicone, Smithsonite Extract, Malachite Extract, Rhodochrosite Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Retinyl Palmitate, Alpha-Arbutin, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Ethylhexylglycerin, Tocopheryl Acetate, Tetrahexyldecyl Ascorbate, Tocopherol, Aluminum Hydroxide, Alumina, Dimethicone/Methicone Copolymer, Dimethicone/PEG-10/15 Crosspolymer, Disodium Cocoyl Glutamate, Disodium EDTA, Dimethicone/Polyglycerin-3 Crosspolymer, Hexyl Laurate, Magnesium Sulfate, Malic Acid, Polysorbate 20, Sodium Chloride, Sodium Cocoyl Glutamate, Synthetic Fluorphlogopite, Sodium Citrate, Trimethylsiloxysilicate, Triethoxycaprylylsilane, PEG-32, PEG-10 Dimethicone, Silica, Hexylene Glycol, Dipropylene Glycol, Caprylyl Glycol, Phenoxyethanol",
  "category" : "mineral",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/3c711478d1b8a9f1c7d9f2c1cdffdb41_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 373,
  "brand" : "nyx",
  "name" : "NYX Mineral Stick Foundation",
  "price" : "11.99",
  "description" : "NYX Mineral Stick Foundation is a luxurious formula that is easy to apply and blend. Use on the entire face or isolated areas that need a little extra attention. Can be blended with fingertips, sponge or foundation brush.Features:Creamy stick foundation that gives a matte satin finishGlides on effortlessly providing medium to full coverage with a natural finishYou can wear as little or as much as you want to get the desired coverage Easy to blend and comfortable to wear at the same timeHow to Use: Apply directly to face from stick or apply using fingers, sponge or brush. Layer and blend for desired result. Set with powder.",
  "category" : "mineral",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f502dbd04258fd8b613887935f0daa53_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 371,
  "brand" : "milani",
  "name" : "Milani Cream-To-Powder Makeup",
  "price" : "10.99",
  "description" : "Meet your new photo-opp BFF. This oil-free, not-quite-foundation - a complexion perfector if ever there was one - glides on as a cream and magically morphs into a powder. Laced with light diffusers for minimizing imperfections, it yields a soft matte, camera-ready finish.Features:Silky, creamy-smooth easy application, blends to a natural matte powder finishOptical light diffusers minimize imperfectionsMirror & sponge applicator includedStreak-freeEasy to useApplication: Apply cream to powder foundation evenly all over face with provided flocked sponge, beginning at the center of the face and blending outward.  Tips: Can be used as a corrector to cover up dark circles and blemishes. For light to medium coverage, apply in circular motions. For more full coverage, use a patting or stippling motion. Ingredients: Dimethicone, Isopropyl Isostearate, Neopentyl Glycol Diethylhexanoate, Tribehenin, Isostearyl Behenate, Silica, Nylon-12, Tridecyl Trimellitate, Talc, Euphorbia Cerifera Cera (Candelilla Wax), Myristyl Myristate, Polyethylene, Trimethylsiloxysilicate, Sorbitan Trioleate, Tocopheryl Acetate, Isopropyl Titanium Triisostearate, Ethylene/Methacrylate Copolymer, Lauroyl Lysine, Myristyl Laurate, Fragrance (Parfum), Propylparaben, Retinyl Palmitate, Glycine Soja (Soybean) Oil, Myristyl Alcohol, Camellia Sinensis Leaf Extract, Benzyl Alcohol, Coumarin, Limonene, Benzyl Salicylate, Linalool, Citronellol, Benzyl Benzoate, Geraniol. +/- May Contain: Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Ultamarines (CI 77007).",
  "category" : "cream",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/296c3f69ab7abdc797d6f0f7092f7a58_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 370,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Mineral Wear Flawless Complexion Kit ",
  "price" : "29.99",
  "description" : "Physicians Formula Mineral Wear Flawless Complexion Kit is ideal for extra sensitive or breakout-prone skin! The ultra-gentle, minimalist formulations help reduce irritation and breakout.Kit Includes: Physicians Formula Mineral Wear Talc-Free Mineral Blush (5.5 g) Mineral Wear Talc-Free Mineral Face Powder     (9 g)Mineral Wear Talc-Free Matte Finishing Veil (16.5 g) - Translucent",
  "category" : "powder",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/c150e6cb030d8b4c8c63a12e6e599332_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 369,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Mineral Wear Correcting Kit ",
  "price" : "29.99",
  "description" : "Physicians Formula Mineral Wear Flawless Complexion Kit is ideal for  extra sensitive or breakout-prone skin! The ultra-gentle, minimalist  formulations help reduce irritation and breakout.Kit Includes: Mineral Wear Talc-Free Mineral Correcting Concealer (11.6 g) - Cover + HighlightMineral Wear Talc-Free Mineral Correcting Powder     (8.2 g)Mineral Wear Talc-Free Mineral Loose Powder (10 g)",
  "category" : "mineral",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/83eaa459937a099c51594ef9578b3821_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 368,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Mineral Wear Airbrushing Pressed Powder ",
  "price" : "19.99",
  "description" : "Physicians Formula Mineral Wear Airbrushing Pressed Powder's ultra-fine mineral powder delivers impeccable coverage for a flawless airbrushed finish. Visibly reduces the appearance of fine lines, wrinkles, pores and sun damage.Directions for Use: Apply liberally 15 minutes before sun exposure.  Use water resistant  sunscreen if swimming or sweating.  Reapply at least every 2 hours.   Children under 6 months: Ask a doctor.  Sun Protection Measures.   Spending time in the sun increases your risk of skin cancer and early  skin aging.  To decrease this risk, regularly use a sunscreen with a  broad spectrum SPF of 15 or higher and other sun protection measures  including: limit time in the sun, especially 10 a.m. - 2 p.m. Wear  long-sleeve shirts, pants, hats, and sunglasses.Ingredients: Titanium Dioxide, Zinc Oxide. Inactive Ingredients: Mica, Zinc Stearate,  Tricaprylin, Boron Nitride, Lauroyl Lysine, Camellia Oleifera Leaf  Extract, Chamomilla Recutita (Matricaria) Flower Extract, Ginkgo Biloba  Leaf Extract, Panax Ginseng Root Extract, Carthamus Tinctorius  (Safflower) Seed Oil, Tocopheryl Acetate, Retinyl Palmitate, Ascorbyl  Palmitate, Magnesium Silicate, Chlorphenesin, Potassium Sorbate, Sodium  Dehydroacetate, May Contain: Iron Oxides, Titanium Dioxide.Hypoallergenic. Fragrance free. Paraben free. Non-Comedogenic. Dermatologist approved.",
  "category" : "mineral",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/cca454e907546544ca9b5b183bb8a96c_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 367,
  "brand" : "pure anada",
  "name" : "Pure Anada Pressed Sheer Matte Foundation Pan",
  "price" : "19.0",
  "description" : "Pure Anada Pressed Sheer Matte Foundation Pan is sheer, and matte and comes in a convenient pan form. Perfect to pop into your own magnetic compact like the Pure Ananda Reusable Magnetic Compact. Design your own palette! Shade Range: Ingredients: Mica, Titanium Dioxide, Zinc Oxide, Silica, Boron Nitride, Iron  Oxides, Ultramarines, *Simmondsia Chinensis ( Jojoba) Seed  Oil,  Caprylic/capric triglyceride *Certified Organic Ingredients",
  "category" : "mineral",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e604b3ea443d37f002b6e74d12733427_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 366,
  "brand" : "maybelline",
  "name" : "Maybelline Mineral Power Natural Perfecting Powder Foundation",
  "price" : "14.99",
  "description" : "Why You'll Love ItMineral Power Powder Foundation with micro-minerals provides a more natural, healthier, luminous look. Discover the natural power of micro-minerals: 100% natural mica creates a more natural luminosity Complete, yet refined coverage Provides buildable, even coverage Preservative-free, talc-free, oil-free, fragrance-free Medium to Full Coverage",
  "category" : "mineral",
  "rating" : 3.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/c77ad2da76259cfd67a9a9432f635bfb_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 365,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Mineral Wear Airbrushing Loose Powder ",
  "price" : "14.99",
  "description" : "Physicians Formula Talc-Free Mineral Wear Airbrushing Loose Powder is an ultra-fine mineral powder delivers impeccable coverage for a flawless airbrushed finish. Visibly reduces the appearance of fine lines, wrinkles, pores and sun damage. Formulated with soothing plant extracts, protective antioxidants, nourishing Vitamins C and E. The result is a visibly firm, smooth, healthy and youthful complexion.Directions for Use: May be worn alone or over makeup. Invert jar and gently tap to allow  powder to gather in tray. Open the sifter lid and lightly buff powder  over face and neck to even out complexion. For the most even  application, be sure to tap excess powder from brush before applying.   For best results on dry to very dry skin, apply moisturizer prior to  using powder.Ingredients: Mica. Boron Nitride. Zinc Stearate. Lauroyl Lysine.  Tricaprylin.  Magnesium Silicate. Carthamus Tinctorius (Safflower) Seed Oil.  Chamomilla Recutita (Matricaria) Flower Extract. Panax Ginseng Root  Extract. Ginkgo Biloba Leaf Extract. Camellia Oleifera Leaf Extract.  Ascorbyl Palmitate. Tocopheryl Acetate. Retinyl Palmitate.  Chlorphenesin. Potassium Sorbate. Sodium Dehydroacetate. May Contain:  Iron Oxides. Titanium Dioxide.Hypoallergenic. Fragrance free. Paraben free. Dermatologist approved. Non-Comedogenic.",
  "category" : "mineral",
  "rating" : 4.6,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/9ad93ab35e838c5a1669cc934c6d93b6_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 364,
  "brand" : "pure anada",
  "name" : "Pure Anada Loose Mineral Foundation ",
  "price" : "12.0",
  "description" : "Pure Anada mineral foundation has the ability to provide full coverage,  while still feeling light and natural. No more silicone based  foundations that can stifle your pores. With Pure Anada your skin can  “breathe”. This results in a healthier, younger looking complexion.You can be assured that when you use Pure Anada, you are using a truly natural product. Pure Anada has done the research, and are committed to using the safest, purest ingredients available. It is not necessary to add preservatives to this loose mineral products. The raw minerals used in Pure Anada are inert, and do not support the growth of bacteria, mold or fungi.Pure Ananda boasts an extensive array of mineral colors to suit all skin tones, and personal preferences. With the proper application techniques, Pure Anada mineral cosmetics can be used by all women! Mature skin types enjoy the light, luminous texture, while problematic skin types take advantage of the full, soothing coverage. These products are concentrated; a little goes a long way!  This makes Pure Anada very affordable. We want The mineral ingredients in Pure Anada have properties that are beneficial to your skin! For example: Titanium Dioxide reflects the sun’s harsh rays away from your skin. Zinc Oxide soothes irritation, and Silica blurs fine lines and wrinkles.Shade Range: Ingredients: Mica, Titanium Dioxide, Zinc Oxide, Silica, Boron Nitride, Iron Oxides, Ultramarines Note: Deeper, global foundation shades do not contain Titanium Dioxide.Brush not included.",
  "category" : "mineral",
  "rating" : 3.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5d746a1619119260de309df7396e5d7c_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 356,
  "brand" : "mineral fusion",
  "name" : "Mineral Fusion Liquid Foundation",
  "price" : "37.0",
  "description" : "Mineral Fusion Liquid Foundation is a luxurious, full-coverage mineral foundation that blends easily for naturally flawless skin.  With a unique fusion of antioxidant-rich Rosehip Oil, Pomegranate, and Vitamin C plus the collagen-boosting Peptide help firm skin and prevent signs of aging without a heavy or greasy feeling.  Formulated with only the safest, most gentle ingredients, the natural UV protection of minerals, plus skin-soothing Licorice Root, Aloe Vera, and Lavender and nourishing Shea Butter. Great for use on all skin types.Features:Flawless, Full CoverageAge-DefyingSkin-SoothingFree of artificial colour or fragranceParaben FreeCruelty FreePhthalate FreeHypo-allergenicIngredients: Aqua, Caprylic/capric triglyceride, Cera alba, Stearic acid, Glycerol caprylate, Glycol palmitate, Glyceryl stearate, Silica, Oryza Sativa (Rice) starch, Mica, Dimethicone, Butyrospermum Parkii (Shea Butter) Fruit, Palmitoyl Tripeptide-5, Aloe Barbadensis (Aloe) Leaf extract, Roman Anthemis Nobilis (Chamomile) extract, Lavandula Angustifolia (Lavender) extract, Punica Granatum (Pomegranate) extract, Glycyrrhiza glabra (Licorice) Root Powder, L-ascorbic-acid (Vitamin C), Tocopherol (Vitamin E), Phenoxyethanol. MAY CONTAIN (+/-): Titanium dioxide, Black Iron oxide, Red Iron Oxide, Yellow Iron Oxide.",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/28f3263536f9d9650997790baf329bbe_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 354,
  "brand" : "maybelline",
  "name" : "Maybelline Dream Velvet Foundation",
  "price" : "18.49",
  "description" : "This Maybelline Dream Velvet Foundation is a refreshing gel-whipped foundation that leaves complexion perfected and smooth with a velvety, soft-matte finish. Skin stays hydrated for 12 hours. Features:Maybelline’s first hydrating matte foundation for 100% velvet-smooth perfectionUnique gel-whipped formulaIdeal for normal to combination skin, medium coverage For best results apply Maybelline Dream Velvet Foundation using Maybelline Dream Blender",
  "category" : "cream",
  "rating" : 2.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/24517c6c81c92eda31cd32b6327c1298_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 353,
  "brand" : "maybelline",
  "name" : "Maybelline Superstay Better Skin Foundation ",
  "price" : "14.99",
  "description" : "The Maybelline Superstay Better Skin Foundation reduces the appearance of spots, bumps, dullness and redness to give you brighter, smoother and more even skin. Features:Longwear that improves skin every minute you're in it: brighter, smoother and more even.With micro-flex technology and the antioxidant power of Actyl-C.Ideal for sensitive skin. Good for all skin types. Medium to full coverageHow to Apply: Apply evenly to your face and blend with your fingers.",
  "category" : "liquid",
  "rating" : 3.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/c7d967ef502ecd79ab7ab466c4952d82_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 352,
  "brand" : "nyx",
  "name" : "NYX Stay Matte But Not Flat Liquid Foundation",
  "price" : "10.99",
  "description" : "NYX Stay Matte But Not Flat Liquid Foundation provides full coverage with a mineral enriched matte finish. The oil-free and water-based formula is perfect whether you are in the studio or out and about all day! Features:Oil freeWater basedFull coverageMineral enrichedMatte finishIngredients: Water / Aqua / Eau, Cyclopentasiloxane, Cyclohexasiloxane, Cetyl Ethylhexanoate, Beeswax / Cera Alba / Cire d’Abeille, Disteardimonium Hectorite Propylene Carbonate, Polyglyceryl-4 Isostearate, Cetyl PEG/PPG-10/1 Dimethicone, Hexyl Laurate, Glyceryl Laurate, Stearyl Dimethicone, Polyglyceryl-4 Oleate, Phenoxyethanol,Methylparaben, Tocopheryl Acetate, Ascorbyl Palmitate, Butylparaben, Ethylparaben, Propylparaben. MAY CONTAIN / PEUT CONTENIR (+/-): Titanium Dioxide ( CI 77891 ), Iron Oxides ( CI 77491, 77492, 77499 ).",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b5a40b7f3a55feb97f7b16987f1fe8c7_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 350,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris True Match Lumi Glow Liquid Foundation",
  "price" : "16.99",
  "description" : "The ultimate in luminosity. L’Oréal Paris introduces its first liquid highlighter specifically crafted to highlight key features or illuminate all-over. Designed in Golden, Rose, and Ice shades that flatter every skintone from warm to neutral to cool. Features:Golden Illuminator enhances peachy or yellow tones in warm skintonesRose Illuminator enhances yellow, peachy, pink or blue tones in neutral skintonesIce Illuminator enhances pink or blue tones in cool skintonesHighlight key features or illuminate all-overLightweight formulaFor every skintone & undertoneINGREDIENTS: AQUA/WATER/EAU, DIMETHICONE, GLYCERIN, ALCOHOL DENAT, SYNTHETIC FLUORPHLOGOPITE, DIMETHICONE/POLYGLYCERIN-3, CROSSPOLYMER, ACRYLAMIDE/SODIUM, ACRYLOYLDIMETHYLTAURATE COPOLYMER, PHENOXYETHANOL, ISOHEXADECANE, CAPRYLYL GLYCOL, POLYSORBATE 80, DIPROPYLENE, GLYCOL TIN OXIDE",
  "category" : "liquid",
  "rating" : 3.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/2a38b2c75a247fe6d1038431964dd24c_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 349,
  "brand" : "covergirl",
  "name" : "CoverGirl Ready, Set Gorgeous Liquid Makeup 105",
  "price" : "8.99",
  "description" : "CoverGirl Ready, Set Gorgeous foundation provides a flawless, natural look that lasts all day in one simple step!Features:Blends easily to even skin tone for a flawless lookShine free look lasts all dayOil free, won't clog poresApplication Tips: Dot foundation on forehead, cheeks and chin. Blend using fingertips or a makeup sponge. Use with any COVERGIRL Pressed Powder to help your look last.",
  "category" : "liquid",
  "rating" : 2.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/414eb9180f66dd8a75ddd34b307e3a36_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 347,
  "brand" : null,
  "name" : "DaLish Silk to Matte Foundation",
  "price" : "44.0",
  "description" : "This long-wear DaLish foundation starts out silky smooth—best applied using your fingers—and dries to a radiant matte finish. Light coverage ensures a natural-looking result, yet the buildable formula evens tone where you need it, for a perfect, cake-free base. Sunflower seed oil, rich in Vitamins A, D, and E, moisturizes, calms and protects skin without clogging pores. Shade Range: F01 - light – for very fair skin tones.FO2 - medium – DaLish's most popular shade. Fair to medium tones.FO3 - dark – for darker tone skin.Ingredients: Water, Coconut Alkanes, Coco-Caprylare/Caprate, Glycerin, Sorbitan Olivate, Polyglyceryl-3 Diisostearate, Caprylic/Capric Triglycerides, Carthamus Tinctoriur (Safflower) Oleosomes, Cetyl Palmitate, Sorbitan Palmitate, Sorbitan Olivate, Zinc Stearate, Sodium Benzoate, Helianthus Annuus (Sunflower) Seed Oil, Rosmarinus Officinals (Rosemary) Leaf Extract, Benzyl Alcohol, Dehydroacetic Acid, Benzoic Acid, Sorbic Acid, Tocopherol, Jojoba Ester May contain (+/-), Titanium Dioxide CI 77891, Mica CI 77019, Iron Oxide CI 77491, Iron Oxide CI 77492, Iron Oxide CI 77499. *Contains natural antioxidant* PEG free *",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e98af12555201b5d34a30e3029191c6d_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 344,
  "brand" : "covergirl",
  "name" : "CoverGirl Clean Liquid Makeup Normal Skin ",
  "price" : "9.49",
  "description" : "Clean Makeup’s formula lets your skin breathe, goes on easily and blends  perfectly, so the world doesn't see makeup, just the look of great  skin. The sensitive skin formula is fragrance and oil free, and is  suitable for sensitive skin. Features: Light coverage, not heavy or cakeyNon-comedogenic (won't clog pores)Dermatologically tested",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/19422d63bf6e51c128bc2fa457fa61dc_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 341,
  "brand" : "covergirl",
  "name" : "CoverGirl Clean Oil Control Makeup ",
  "price" : "9.49",
  "description" : "With CoverGirl's Clean Oil Control Makeup, you'll get all the shine control you  want – without the drying coverage you don't. The Clean foundation with  gentle oil absorbing powders and skin conditioners, help prevent  dryness. Best of all, it won't clog pores, for a clean, shine-free face,  hour after hour!Features: Oil and fragrance freeNon-comedogenic (won’'t clog pores)Dermatologically-testedWon’'t clog pores",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/700e432a504f4784792e84d498c982b7_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 340,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Nude Wear Touch of Glow Foundation",
  "price" : "18.49",
  "description" : "Physicians Formula Nude Wear Touch of Glow Foundation is a weightless fluid foundation that dresses your skin in an illuminating veil of radiance.  This airy foundation is formulated with translucent, 100% perfecting nude pigments.Features: HypoallergenicFragrance, Paraben, Gluten & Oil freeNon-ComedogenicDermatologist ApprovedDirections: Shake bottle before each use. Apply foundation directly onto enclosed Perfecting Foundation brush and blend with brush until desired coverage is achieved.Ingredients: Cyclopentasiloxane, Water, Cyclohexasiloxane, Butylene Glycol, Dimethicone, Cetyl PEG/PPG-10/1 Dimethicone, Mica, Silica, Polyglyceryl-4 Isostearate, PEG/PPG-18/18 Dimethicone, Tropaeolum Majus Flower/Leaf/Stem Extract, Lactic Acid, Dimethicone/PEG-10/15 Crosspolymer, PEG-10 Dimethicone, Glycerin, Calcium Aluminum Borosilicate, Sodium Chloride, Nylon-12, Dimethicone/Polyglycerin-3 Crosspolymer, Hexyl Laurate, Tribehenin, Magnesium Sulfate, Polysorbate 20, Synthetic Fluorphlogopite, Disodium Cocoyl Glutamate, Caprylyl Glycol, Ethylhexylglycerin, Hexylene Glycol, Tocopheryl Acetate, Triethoxycaprylylsilane, Sodium Cocoyl Glutamate, Tetrahexyldecyl Ascorbate, Lauroyl Lysine, Dipropylene Glycol, Sodium Citrate, Tocopherol, Phenoxyethanol. May Contain: Iron Oxides, Titanium Dioxide.",
  "category" : "liquid",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b94e7fe160e5564b9a8282938d3dabae_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 338,
  "brand" : "covergirl",
  "name" : "CoverGirl Advanced Radiance Age Defying Liquid Makeup ",
  "price" : "12.49",
  "description" : "Take 5 years off the look of your skin.* This smooth liquid foundation  with Olay ingredients blends into the skin, covering fine lines and  wrinkles, for radiant, beautiful coverage that actually helps give you a  youthful looking appearance.                                  * Tested among women 35-65.Features:Protects with SPF 10Suitable for sensitive skinDermatologically-testedNon-comedogenic (won't clog pores)Oil-free",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/9b13eee88cc626be90db443abb6e8bb9_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 336,
  "brand" : "revlon",
  "name" : "Revlon Age Defying Firming + Lifting Makeup",
  "price" : "19.99",
  "description" : "Revlon Age Defying Firming + Lifting Makeup is an advanced anti-aging multi-benefit makeup. Firm. Lift. Hydrate. Cover. 93% of women saw noticeably improved skin.* This all-in-one formula combines hyaluronic acid, a potent dose of  moisturizing ingredients and our exclusive Triple Lift Complex™. Relax  the look of expression lines, give skin a smooth, tightened feel and  boost hydration 3X. For a radiant, rejuvenated look.**    *after 8 weeks **skin feels tighter after 4 weeks, rejuvenated after 1Directions: Apply with fingertips,  sponge or brush, blend foundation onto skin, starting in the center of  your face, forehead, nose and chin blending outward",
  "category" : "liquid",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/0215f4c5565bd4e8215969c6aa93e89c_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 335,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris True Match Lumi Cushion Foundation",
  "price" : "26.99",
  "description" : "Liquid foundation revolutionized – a fresh luminous glow in a tap. Introducing the new L'Oreal Paris True Match Lumi Cushion, an innovative cushion drenched in liquid foundation. Tap a little for a fresh natural glow, tap on more to build a new level of luminous coverage.Features:Effortless applicationCompletely buildableOn-the-go coverageFormulated with Precise Match Technology to match your skin’s tone and textureAvailable in 8 true-to-skin shadesFinish: fresh & luminousCoverage: sheer to medium, buildable coverageFor all skin types",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/0350aac08c86bccd97c2a5ca26b15ae9_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 334,
  "brand" : "cargo cosmetics",
  "name" : "Cargo Cosmetics OneBase for Face",
  "price" : "28.0",
  "description" : "Many women don’t need foundation everywhere.   OneBase™ allows you to cover areas around the eyes, nose and mouth to  conceal imperfections.  It then blends out perfectly to natural skin. Cargo's OneBase combines superior coverage and precision application in the ease of a  sleek tube and wand combination. It is the perfect product for those who  do not want full-face foundation coverage – designed for natural  coverage in key facial areas. Nourishing ingredients and conditioning  properties provide moisture to the skin. Fragrance free and excellent  for delicate, sensitive skin with essential essences that condition the  skin and will not clog the pores.    Features: Nourishing ingredients and conditioning properties provide moisture to the skinFragrance -free and excellent for delicate, sensitive skin Sold in a sleek, malleable metal tube with a touch wand that is both easy and practical ALL SKIN TYPESKey Ingredients: Vitamin E helps the skin to fight the damaging effects of the  environment and helps to moisturize the skin and repair minor damage  found on the surface of the skinChamomile Extract  is a natural essential essence that is  ideal for dry and sensitive skin types. Its naturally soothing and  relaxing properties make it an exceptional ingredient for skin care  productsAvocado Extract  is rich in natural vitamins that help to nourish the skinShade Range: Application: Using enclosed touch wand, dab OneBase to key areas of the face blend out with finger tipsUse under the eyes and on eyelids to brighten the eye area and prime the lids for shadowIf desired, OneBase can be used alone as a foundation replacement for  key facial areas, or under liquid foundation for full-face coverageIngredients: Water (Aqua), Cyclomethicone, Propylene Glycol, Talc, Triethanolamine,  Polyglyceryl-3 Diisostearate, Dimethicone Copolyol, Sodium Chloride,  Methylparaben, Methicone, Propylparaben, Tribehenin, Tocopheryl Acetate,  Anthemis Nobilis Flower Extract, Aloe Barbadensis Extract, Persea  Gratissima (Avocado) Oil, Retinyl Palmitate, Glycosaminoglycans, Sodium  Chondroitin Sulfate. May Contain (+/-): Titanium Dioxide (CI 77891),  Iron Oxides (CI 77491, CI 77492, CI 77499), Carmine (CI 75470), Chromium  Oxide Green (CI 77288), Manganese Violet (CI 77742), Ultramarines (CI  77007).",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/04c6f1353fdaf82d48a9d3ecf0d619f4_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 333,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Youthful Wear Spotless Foundation",
  "price" : "18.49",
  "description" : "Physicians Formula Youthful Wear Spotless Foundation is the 1st-to-Market ultra-fluid foundation delivers skin-perfecting coverage, an incredible sensorial experience and a finish so natural, it looks invisible on the skin.The 35% silicone formula creates a revolutionary, weightless liquid veil texture, combining the best of both worlds: flawless, spotless coverage + the feeling you have no makeup on at all.With just one drop, skin is immediately brighter, smoother and more even!Hypoallergenic. Paraben-Free. Gluten Free. Dermatologist approved. Non-Comedogenic. Clinically Tested.",
  "category" : "liquid",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/99d879544d3e44842f2437e17c9ef52a_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 332,
  "brand" : "annabelle",
  "name" : "Annabelle SkinTrue Foundation",
  "price" : "10.99",
  "description" : "Truly flawless, natural-looking skin is what you can expect  from Annabelle SkinTrue Foundation. Its oil-Free, soft and matte finish makes you feel  like you're wearing nothing at all, just beautiful skin. It blends  easily to even out the skin tone yet feels extremely light and natural.  Oil-Free. Shade Range:",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/c1b6c4f04c4f2c43ec1331049e65c280_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 331,
  "brand" : "almay",
  "name" : "Almay Smart Shade Skintone Matching Makeup ",
  "price" : "17.29",
  "description" : "Almay Smart Shade™ makeup makes it easy to find “the one” with just three skintone-adjusting shades to choose from, not hundreds! It adjusts to the natural tones and nuances of your skin with breakthrough new Almay ToneMimic™ shade-sensing bead technology which intuitively transforms to your skintone for all day natural looking coverage in your perfect shade. Contains broad spectrum SPF 15. HYPOALLERGENIC. DERMATOLOGIST TESTED. MADE FOR SENSITIVE SKIN.Shade Range:",
  "category" : "liquid",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/afcbd92c05ea8b6452eabc80e2b9d549_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 330,
  "brand" : "l'oreal",
  "name" : "L'Oreal Visible Lift Serum Absolute",
  "price" : "20.49",
  "description" : "Introducing a breakthrough in age minimizing makeup.Only Visible Lift Serum Absolute features an age reversing serum of 5 ingredients in 1 luminous makeup. This new makeup instantly evens skin tone with a luxuriously lightweight formula that doesn't settle into lines and wrinkles.In 4 weeks, the potent formula addresses 5 sighs of aging to visibly transform skin to smoother, firmer, brighter, even, flawless.5 proven results :  45% more even skin tone 72% saw more youthful skin 75% reduction inf ine lines and wrinkles 79% saw fewer imperfections 90% saw smoother skin  Finish : LuminousCoverage : MediumSkin Type : All skin types",
  "category" : "liquid",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/39be9facd53cf124ff38e9a25de09e10_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 329,
  "brand" : "almay",
  "name" : "Almay Smart Shade Anti-Aging Skintone Matching Makeup",
  "price" : "17.29",
  "description" : "Almay Smart Shade™ anti-aging makeup makes it easy to find “the one” with just three skintone-adjusting shades to choose from, not hundreds! It adjusts to the natural tones and nuances of your skin with breakthrough new Almay ToneMimic™ shade-sensing bead technology which intuitively transforms to your skintone for your perfect shade while helping to erase flaws and imperfections. 4 out of 5 women saw an instant reduction in the appearance of fine lines and wrinkles. Helps protect against sun damage with broad spectrum SPF 20. HYPOALLERGENIC. DERMATOLOGIST TESTED. MADE FOR SENSITIVE SKIN. Shade Range:",
  "category" : "liquid",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/39ef46015c299f19fad898e6ce14f131_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 328,
  "brand" : "almay",
  "name" : "Almay Truly Lasting Color Makeup",
  "price" : "17.29",
  "description" : "Longwear meets skincare.tlc truly lasting color makeup delivers up to 16 hours of flawless coverage that won't rub off - even in heat and humidity. Plus, it nourishes skin with antioxidant green tea to protect, vitamin E to help smooth and lemon extract to brighten... for all day, natural radiance. Now, that's tlc.hypoallergenic • oil-free • won't clog pores • dermatologist tested",
  "category" : "liquid",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f080c72085d7746687375cdcfdf62a94_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 327,
  "brand" : "covergirl",
  "name" : "CoverGirl Outlast Stay Fabulous 3-in-1 Foundation ",
  "price" : "12.49",
  "description" : "CoverGirl Outlast Stay Fabulous 3-in-1 foundation is an all-in-one foundation with a long-lasting formula that fuses primer,  concealer, and foundation in one easy step! The 3-in-1 formula provides a  flawless look that lasts all day long.Features: All day, longwear formulaPrimer, concealer, and foundation in oneSmooth, flawless finishFoundation + Sunscreen SPF 20",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f047b24948adf8c9d5f6b795db107920_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 326,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris True Match Lumi Healthy Luminous Foundation",
  "price" : "20.99",
  "description" : "Finally, makeup that creates skin so healthy - it's luminous.True Match Lumi Healthy Luminous Makeup combines 3 powerful ingredients that work to improve your complexion the more you wear them. 40% pure water for all-day hydration;Antioxidants and Vitamins C and E for improved clarity and skin tone and;Liquid Light Technology for an instant, luminous glowIsn't it time your met your match?Additional Features: SPF 20Lightweight, buildable coverage that lasts up to 8 hoursFor all skin typesSafe for sensitive skinNon-Comedogenic. Dermatologist tested. Allergy tested.",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/7d8276b94863d7cff212d0161b5c632e_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 325,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Infallible Pro-Matte Foundation",
  "price" : "19.99",
  "description" : "Longwear foundation without the compromise. Never masky, never cakey, never dull – Infallible Pro-Matte™ is L’Oréal’s next generation of longwearing makeup.The micro-sponge technology absorbs excess oil and shine to create a dimensional matte finish without the need for a heavy or caked-on look. Use a sponge to buff it out for a sheer and natural look or apply in layers for more complete coverage.",
  "category" : "liquid",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/268da4d7967fad9c153af24ee8d2e026_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 324,
  "brand" : "revlon",
  "name" : "Revlon ColorStay Makeup for Normal / Dry Skin",
  "price" : "19.99",
  "description" : "Revlon ColorStay Makeup provides longwearing coverage with a lightweight  formula that won’t cake, fade, or rub off.  With Time Release  Technology, this oil-free, moisture-balance formula is especially  formulated for normal or dry skin to continuously provide hydration.Features: Makeup feels comfortable and wears for up to 24 hours Medium to full coverage Comes in a range of beautiful shades",
  "category" : "liquid",
  "rating" : 4.6,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/197e268a36cdc0b05fc8758a2d959485_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 323,
  "brand" : "dr. hauschka",
  "name" : "Dr. Hauschka Foundation",
  "price" : "39.0",
  "description" : "Dr. Hauschka Foundation features pomegranate essence, macadamia and coconut oil that preserve the moisture  content of the skin and offer it protection. Available in five shades,  the foundation does not cover the skin but instead balances out  unevenness, giving the complexion a smooth, vibrant look.Features: Truly natural and/or organic cosmetics, certified to NATRUE and/or BDIH standardsFree from synthetic fragrances and preservativesFree from mineral oils, parabens, silicone and PEGVeganDermatologically tested for sensitive skinWherever possible, all raw materials come from controlled organic or Demeter cultivation and are recovered under fair conditionsIngredients: Water (Aqua), Alcohol, Simmondsia Chinensis (Jojoba) Seed Oil, Anthyllis Vulneraria Extract, Cocos Nucifera (Coconut) Oil, Caprylic/Capric Triglyceride, Glycerin, Cetearyl Alcohol, Punica Granatum Fruit Extract, Prunus Armeniaca (Apricot) Kernel Oil, Butyrospermum Parkii (Shea) Butter, Macadamia Ternifolia Seed Oil, Daucus Carota Sativa (Carrot) Root Extract, Euphorbia Cerifera (Candelilla) Wax, Fragrance (Parfum), Limonene*, Linalool*, Geraniol*, Citronellol*, Benzyl Benzoate*, Benzyl Salicylate*, Farnesol*, Coumarin*, Citral*, Eugenol*, Benzyl Alcohol*, Bentonite, Xanthan Gum, Sodium Cetearyl Sulfate, Silica. [May contain (+/-) Mica, Iron Oxides (CI 77491, CI 77492, CI 77499), Titanium Dioxide (CI 77891), Ultramarines (CI 77007)].*from natural essential oils",
  "category" : "liquid",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/965ec1b8b64ab44496aa44f6b4a1ea01_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 322,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Flawless Finish Foundation",
  "price" : "9.99",
  "description" : "Achieve a flawless complexion with the silky smooth e.l.f. Studio  Flawless Finish Foundation. The lightweight and oil-free formula blends  in naturally for a beautiful semi-matte finish. This liquid foundation  applies easily and lasts all day for visibly brighter and radiant  looking skin. Using e.l.f.'s Flawless Finish Foundation not only restores  uneven skin textures and tones, but most importantly, the SPF 15  protects your skin against harmful sun damage!Shade Range:                    ACTIVE INGREDIENTS:  Octyl Salicylate 2%,   Titanium Dioxide 5.5% INACTIVE INGREDIENTS:   Water (Aqua), Cyclopentasiloxane, Isododecane, Hydrogenated  Polyisobutene, Cetyl PEG/PPG-10/1 Dimethicone, Polyglyceryl-4  Isostearate, Polymethyl Methacrylate, Sorbitan Sesquiisostearate,  Butylene Glycol, Talc, Dimethicone, Disteardimonium Hectorite, Magnesium  Sulfate, Glycerin, Phenoxyethanol, Synthetic Beeswax, Potassium  Sorbate, Propylene Carbonate, Boron Nitride, Barium Sulfate, Caprylyl  Glycol May Contain: Iron Oxides (CI 77491, CI 77492, CI 77499)",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f930f8fcd14f31ce1700faf24c4606f5_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 321,
  "brand" : "maybelline",
  "name" : "Maybelline Dream Liquid Mousse",
  "price" : "14.79",
  "description" : "Airbrushed perfection made possible:Air-whipped liquid makeup for 100% poreless skin  Breakthrough finish cushions and smooths for the most flawless, luminous coverage Lightweight air-whipped formula blends to virtually eliminate pores and imperfections Innovative shade-match pump makes finding your perfect shade a dream",
  "category" : "liquid",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/1ca6a4a442b9aa6b5f3d94da77d8846c_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 320,
  "brand" : "maybelline",
  "name" : "Maybelline FIT ME! Matte + Poreless Foundation",
  "price" : "10.99",
  "description" : "Maybelline FIT ME! Matte + Poreless Foundation goes beyond  skin tone  matching to fit the unique texture issues of normal to oily skin for  the ultimate natural skin fit.  While some foundations can exaggerate pores and oily skin, only Maybelline's  pore-minimizing foundation contains their genius blurring micro-powders  that erase pores and absorb oil for a naturally matte and  poreless-looking finish.Dermatologist and allergy tested.  Does not clog pores. Oil-free.",
  "category" : "liquid",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/257993e12625cc45a72ec03636ffa5c5_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 319,
  "brand" : "revlon",
  "name" : "Revlon ColorStay Makeup for Combination / Oily Skin",
  "price" : "19.99",
  "description" : "Revlon ColorStay Makeup  provides longwearing coverage with a lightweight  formula that won’t cake, fade, or rub off.  With Time Release Technology  specifically formulated for combination or oily skin to control oil  absorption and shine.  Your look stays flawless throughout the day. Features: Makeup feels comfortable and wears up to 24 hours.Medium to full coverage.Comes in a great range of beautiful shades.",
  "category" : "liquid",
  "rating" : 3.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/844f8a41bfd962e75295db3b75ad3167_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "foundation"
}, {
  "id" : 318,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris True Match Super Blendable Makeup TESTING",
  "price" : "18.70",
  "description" : "True Match Super-Blendable Makeup precisely matches your skin’s tone  and texture and coordinates perfectly with True Match Powder, Blush and  Concealer. Formulated with Precise Match Technology so you can control  coverage and fine-tune it.The ultra-pure formula contains no oils,  fragrances, or pore-clogging fillers, so all you see is beautiful,  radiant, flawless skin. Features:Finish: NaturalCoverage: Light to mediumSkin Type: For all skin types",
  "category" : "liquid",
  "rating" : 4.1,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/c71a2c6a4f7d41ceb60f068780bcfba5_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : ""
}, {
  "id" : 317,
  "brand" : "maybelline",
  "name" : "Maybelline Fit Me Foundation with SPF",
  "price" : "10.99",
  "description" : "It’s face makeup that fits you!Features: No oils, no waxes, no nonsenseNatural, Light to medium coverage that leaves skin the way it was meant to be. Fresh, breathing, flawless.Exclusive transluscent base and lightweight pigments allow skin’s natural highs and lows to show through.New shades formulated specifically for women of color contain  revolutionary 5-D pigment technology to balance your skin’s authentic  tones and highlights.SPF 18",
  "category" : "liquid",
  "rating" : 3.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/eccb88d484b8c929fd349b0995a5dba2_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "foundation"
}, {
  "id" : 316,
  "brand" : "pure anada",
  "name" : "Pure Anada Smooth & Conceal Liquid Foundation",
  "price" : "25.0",
  "description" : "Smooth and conceal fine lines and imperfections with this  moisturizing, full coverage formula from Pure Anada. A non-greasy texture with the  skin-loving benefits of virgin, organic coconut oil. Infused with Argan  & Sea Buckthorn, this truly is superfood for your skin! Apply directly to clean, moisturized skin, making sure to blend well. For less coverage, you may mix the foundation with your favorite moisturizer.Shade Range: Arctic Alabaster -  A porcelain shade of foundation for the very lightest of skin tones. A white shade of foundation slight pink undertones, Arctic Alabaster is perfect for people who can never find a foundation light enough for their complexion.Beige in Banff - This is a medium shade of foundation for a lady who has a deep pink complexion.  It also blends well on tanned Caucasian skin with beige, (as opposed to gold) undertones.Prairie Rose - This is a cool beige shade in the light range. It suites the fair complexion that has obvious pink undertones.Atlantic Bisque - A popular fair shade of foundation due to its balanced beige undertones.Sunkissed Canadian - This shade is perfect for a fair complexion with a bit of a \"pink\" tan! It has warm rose, rather than gold undertones. Our most popular shade!Pacific Tan - A neutral shade that exudes more bronze than golden tones for women with tanned complexions.Ivory Chinook - This is a warm neutral shade that looks very natural on a variety of light skin types. It helps tone down redness and even skin tone. Soft Wheat - This is a warm neutral shade that is darker than Ivory Chinook. Its warm undertones help tone down redness and even skin tone.Amber Honey - This foundation suits Caucasian women with very dark, golden tanned skin. Because of it's high concentration of yellow pigment, it can also be worn by certain ethnic groups.Flaxen Field - A cool, olive shade of foundation for light to medium skin tones. It is perfect for people who find other shades too \"orange\". Suitable for some Asian complexions.Niagara Fawn - A cool olive shade of foundation for medium to deep skin tones.  For deep olive, tanned complexions and many other ethnicities.Cappuccino - A deep, warm olive foundation.Swiss Chocolate - A neutral chocolate brown that suits many deep skin tonesEbony - A deep brown/black shade of foundation for the darkest of skin tones.Ingredients: Water (Aqua), Caprylic / Capric  Triglyceride, (Derived from Coconut), Cetearyl Olivate, Sorbitan  Olivate, Simmondsia Chinensis (Organic Jojoba) Seed Oil, Cocos Nucifera  (Virgin Organic Coconut Oil), Ricinus Communis (Castor Seed Oil),  Argania Spinosa (Argan Oil), Hippophae Rhamnoides (Sea Buckthorn), Cetyl  Alcohol, Mica, Titanium Dioxide, Zinc Oxide, Iron Oxides, Ultramarines,  Sorbitol, Leuconostoc/Radish Root Ferment Filtrate",
  "category" : "liquid",
  "rating" : 4.1,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/066dd839fc77495347ecfe44a4636e57_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 315,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Tinted Moisturizer",
  "price" : "4.99",
  "description" : "Achieve even skin tone  and naturally radiant skin with this moisturizing sheer tint of color.   The smooth formula enhances your complexion with the nourishing key  ingredients Aloe, Cucumber and Vitamins A, C & E.Shades:                    ACTIVE: Benzophenone-3, Ethylhexyl Isopalmitate, Titanium Dioxide.  INACTIVE: Water, Mineral Oil, Cyclomethicone, C12-15 Alkyl Benzoate,  Propylene Glycol, Dimethicone, Steareth-21 Cetearyl Alcohol,  Ceteareth-2, Glyceryl Stearate, Xanthan Gum, Methylparaben,  Propylparabem, Tocopherol(VE), Retinyl Acetate(VA), Ascorbyk  Palmitate(VC), Aloe Barbadensis (Aloe Vera) Leaf Juice, Cucumis Sativus  (Cucumber) Fruit Extract, MAY CONTAIN: Iron Oxides (CI 77491, CI 77492,  CI 77499), Titanium Dioxide (CI 77891)",
  "category" : "liquid",
  "rating" : 3.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/fa4c4e189875760b7d75f327706096f9_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "foundation"
}, {
  "id" : 313,
  "brand" : "covergirl",
  "name" : "CoverGirl Trunaked Eyeshadow Palettes in Roses",
  "price" : "12.99",
  "description" : "CoverGirl Trunaked Eyeshadow Palettes feature universally flattering, neutral shades that are made to be blended together, so you can mix and match colors and always look flawless. Features:Each eye shadow palette comes with 8 shadesEach shade is highly pigmentedEndless possibilities for neutral daytime to dramatic nighttime looks",
  "category" : "palette",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e8be715d17f0bcc25ffe81f4286ffac0_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeshadow"
}, {
  "id" : 311,
  "brand" : "l'oreal",
  "name" : "L'Oreal Colour Riche La Palette Nude in Nude 02",
  "price" : "29.99",
  "description" : "Inspired by makeup designers 'Must Have' palettes, the L'Oreal La Palette Nude  offers everything you need to master the art of nude eyeshadow. Get Makeup  Designer Nude looks curated exclusively for each palette with step by  step instructions and live tutorials!Features: 10 highly pigmented shades range  from light to dark to flatter every skin tone in 3 shadow finishes:  shimmery satin, buttery matte & lustrous sheenEye-designer brush & mirror for effortless application",
  "category" : "palette",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/d6bf791aee472d5cc9d402a4227b10b8_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeshadow"
}, {
  "id" : 306,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Shimmer Strips Extreme Shimmer Shadow & Liner Palette ",
  "price" : "15.79",
  "description" : "This Physicians Formula Shimmer Strips Extreme Shimmer Shadow & Liner Palette gives you 6 shades to enhance and illuminate your eyes for the perfect look!Features: Wet & Dry application for 2 finishesLong wearing, blendable formula for up to 24hr wearHypoallergenicParaben & gluten freeDermatologist approvedSafe for sensitive eyes and contact lens wearerDirections: Sweep medium shade over lid as base.  Apply darkest shade to upper and lower lash line with pointed tip of applicator to line eyes. For added definition, apply darkest shade in the contour of upper eyelid.  To intensify color wet applicator, use lightest shade to highlight brow bone.Ingredients: Mica, Bis-Diglyceryl Polyacyladipate-2, Calcium Aluminum Borosilicate, Caprylic/Capric Triglyceride, Diisostearyl Malate, Silica, Talc, Phenyl Trimethicone, Calcium Sodium Borosilicate, Dimethicone, Boron Nitride, Caprylyl Glycol, Dimethicone/Vinyl Dimethicone Crosspolymer, Ethylhexylglycerin, Magnesium Stearate, Nylon-12, Sodium Dehydroacetate, Synthetic Fluorphlogopite, Tin Oxide, VP/Hexadecene Copolymer. May Contain/Peut Contenir: Iron Oxides, Manganese Violet, Titanium Dioxide.",
  "category" : "palette",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/cefc37500e17a39af22b2be42ac00abf_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeshadow"
}, {
  "id" : 304,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Essential Little Black Beauty Book Eye Edition",
  "price" : "9.99",
  "description" : "This convenient 48-piece makeup collection for your eyes allows you to  have your Little Black Beauty Book readily available anytime, anywhere!  Keep the Beauty Book in your purse, at home or in the office so you can  be your own makeup artist whenever, wherever. This full assortment of 48  eyeshadow colors allows you to create a look that reflects your  personal style for any occasion. The small, sleek design is great for  on-the-go beauty touch ups. Each book includes: 48 gorgeous eyeshadow  shades, a built-in mirror, and 1 dual-ended applicator.Ingredients: Talc, Mica, Zinc Stearate, Kaolin,  Paraffinium Liquidum(Mineral Oil), Petrolatum, Bis-Diglyceryl  Polyacyladipate-2, Methylparaben, Propylparaben. May Contain: Iron  Oxides (CI 77491 , CI 77492 , CI 77499), Manganese Violet (CI 77742),  Mica (CI 77019), Titanium Dioxide (CI 77891), Yellow No.5 Lake (CI  19140), Red No.40 Lake (CI 16035), Ultramarine Violet (CI 77077), Blue  No.1 Lake (CI 42090)",
  "category" : "palette",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/19b83ad09d00473a3258b74f69dfbb20_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeshadow"
}, {
  "id" : 298,
  "brand" : "revlon",
  "name" : "Revlon PhotoReady Primer, Shadow + Sparkle Palette",
  "price" : "14.49",
  "description" : "Easily create limitless looks with this one Revlon PhotoReady Primer, Shadow + Sparkle Palette. The palette features a primer, 3 highly pigmented shadows, and a  sparkle top coat. You can use wet for more colour intensity and add the sparkle top  coat for a multi-dimensional, intensely shimmering effect.Shadow Shades:",
  "category" : "palette",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b35505ef545ea7e478d0da882d8e93d8_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeshadow"
}, {
  "id" : 295,
  "brand" : "maybelline",
  "name" : "Maybelline The Nudes Eye Shadow Palette",
  "price" : "17.99",
  "description" : "Maybelline The Nudes Eye Shadow Palette let's you create looks from day to night. Deep to light. So try it out and create your ideal eye look today!Features:             13 looks in one Expert Wear eyeshadow palette Extraordinary Colour, from soft highlights, to medium bronze, to rich black From Maybelline's ultra-blendable pigments Long Wear",
  "category" : "palette",
  "rating" : 2.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/201350fd3e173307ade44520dc87d8fb_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeshadow"
}, {
  "id" : 293,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Mad for Matte Eyeshadow Palette ",
  "price" : "11.99",
  "description" : "Achieve both beautifully bold or subtle everyday eye looks with these perfectly curated 10 matte eyeshadow shades. This collection of hues is ideal for shading, highlighting, and defining the eyes. The satin matte shadows can be used as a liner, on the lid, and in the crease of the eye for an expertly contoured and blended look. How To Use: Apply dry all over the eyelid with a brush for a subtle wash of colour or apply wet for a vibrant effect.  Start with a light color and apply the shade all over your eyelid as a base.  Next, apply a medium shade over the eyelid and the eye crease using the crease brush.  Finally, apply the darkest shade over your eyelid. Ingredients: Talc, Mica, Silica, Magnesium Stearate, Nylon-12, Ethylhexyl Palmitate, Dimethicone, Phenoxyethanol, Caprylyl Glycol. May Contain:Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Manganese Violet (CI 77742), Red 40 Lake (CI 16035), Ultramarines (CI 77007)",
  "category" : "palette",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/fa63b99f27bbcb78998db3f2436b4764_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeshadow"
}, {
  "id" : 290,
  "brand" : "dr. hauschka",
  "name" : "Dr. Hauschka Eye Shadow Palette",
  "price" : "43.0",
  "description" : "Four matte shades enhance the natural beauty of your eyes, allowing for a combination of elegant looks that take eyes from day to night.  Silk powder offers pH balancing and protective qualities.  Apply eyeshadow to the eyelid using the applicator, starting at the inside corner and working outwards. When using two colours, apply the darker shade to the outer corner and the lighter shade to the inner corner of the eye, or use as a highlighter under the eyebrow arch.Features:Truly natural and organic cosmetics, certified to NATRUE and/or BDIH standardsFree from chemical/synthetic fragrances and preservativesFree from mineral oils, parabens, silicone and PEGDermatologically tested for sensitive skinWherever possible, all raw materials come from controlled organic or Demeter cultivation and are recovered under fair conditions",
  "category" : "palette",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/be56826f6ed902203a0616930c4de5ea_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeshadow"
}, {
  "id" : 288,
  "brand" : "pacifica",
  "name" : "Pacifica Mystical Supernatural Eye Shadow Palette",
  "price" : "28.0",
  "description" : "An incredibly innovative formula that pushes mineral makeup color to new  bounds.  Rich, lasting, ceaseless eye shadows are infused with coconut  water for a velvety, cream-like finish.  These four highly pigmented  mineral satin makeup and iridescent shades are specially curated are  designed to brighten the eyes and make you look gorgeous and awake.   (Even when you did not get a good night's sleep!) Includes 4 Beautiful Shades:Opal - Opalescent pinkish-white perfect for highlighting and creating a natural look.  Use on brow bones, inner eye and even as a linerMoonbeam - Pearlescent greyish moody violet to use on lids or create a subtle smoky eyeCelestial - Creamy dreamy beige with a little bright pearl ideal for lids and highlightsStargazer - Heavenly hot blue-violet to smudge, smoke or line your eyesFeatures: Coconut infused long lasting eye shadows that apply easy with a velvety finishNatural mineral colorsRecyclable packaging100% vegan, No animal ingredients or testingFREE OF PARABENS, PHTHALATES, PETROLEUM, TALC, FD&C COLORS and other ingredients you don't want on your skinIngredients:Opal Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide  CI77510, Iron Oxides C1 77491,  CI 77742, C177499.Moonbeam Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide  CI77510, Iron Oxides C1 77491,  CI 77742, C177499. Celestial Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide  CI77510, Iron Oxides C1 77491,  CI 77742, C177499.Stargazer Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide  CI77510, Iron Oxides C1 77491,  CI 77742, C177499.",
  "category" : "palette",
  "rating" : 4.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/8b25aa939044e24c7de93036977901d8_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeshadow"
}, {
  "id" : 286,
  "brand" : "maybelline",
  "name" : "Maybelline The Nudes Eyeshadow Palette in The Blushed Nudes",
  "price" : "17.99",
  "description" : "Create looks from day to night and deep to light with Maybelline's The Blushed Nudes Eyeshadow Palette.Features:13 looks in one eyeshadow paletteExtraordinary colour from ultra-blendable pigmentsLong wear with sensual finish that lasts up to 12 hours",
  "category" : "palette",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/49d98e112e77d2a9a0c8fad28df89a1e_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeshadow"
}, {
  "id" : 284,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Prism Eyeshadow",
  "price" : "13.99",
  "description" : "These ultra-silky and lustrous eyeshadows look like a powder but feel like a cream, allowing for a smooth and flawless application. Use to contour, line, and highlight for a radiant finish. The luminous, shimmery formula creates a gorgeous range of looks for both day and night.",
  "category" : "palette",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/7282990c0ae826129a437ff3cb823cab_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeshadow"
}, {
  "id" : 283,
  "brand" : "pacifica",
  "name" : "Pacifica Enlighten Eye Brightening Shadow Palette",
  "price" : "28.0",
  "description" : "An incredibly innovative formula that pushes mineral makeup color to new bounds.  Rich, lasting, ceaseless eye shadows are infused with coconut water for a velvety, cream-like finish.  These four highly pigmented mineral satin makeup and iridescent shades are specially curated are designed to brighten the eyes and make you look gorgeous and awake.  (Even when you did not get a good night's sleep!) Includes 4 Beautiful Shades:Urchin - An iridescent jeweled purple with gold tones.  Use dry as a shadow, wet as a liner.  Perfect for smudging and a great substitute for black.Golden - A perfect gold with just the right amount of shimmer.  Use on the lids or line the eyes.Coral Sand - A satin lid base or highlighter. Skinny Dip - Matte nude base, a universal brightener.  Perfect for using on the inner eye to add brightness.Formulated without: Phthalates, parabens, carmine, beeswax, lanolin, mineral oils, propylene glycol, petroleum and FD& C colors (along with other nasties you do not want on your skin).  No animal testing. Gluten-free, 100% vegan and cruelty-free.Ingredients: Coral Sand Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide CI77510, Iron Oxides C1 77491, CI 77742, C177499.Skinny Dip Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide CI77510, Iron Oxides C1 77491, CI 77742, C177499.Urchin Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide CI77510, Iron Oxides C1 77491, CI 77742, C177499.Golden Ingredients: Mica, Zinc Stearate, Ethylhexyl Stearate(Plant Source), , Cocos Nucifera (Coconut) Oil, Carthamus Tinctorius(Safflower) Seed Oil, Macrocystis, Pyrifera (Brown Kelp) Extract, Panax (Ginseng) Root Extract. May Contain: Silica, Dimethicone, Calcium Sodium Borosilicate, Tin Oxide, Titanium Dioxide, CI 7789, Ferric Ferrocyanide CI77510, Iron Oxides C1 77491, CI 77742, C177499.",
  "category" : "palette",
  "rating" : 4.6,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/eea39137208ea1ea7754c6c6e95689c5_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeshadow"
}, {
  "id" : 282,
  "brand" : "wet n wild",
  "name" : "Wet n Wild Color Icon Eye Shadow Collection",
  "price" : "4.99",
  "description" : "Eight dynamic, perfectly color-coordinated shades with high pigment and  pearl for ultra-impact color. Shades can be used together or  individually to create an endless variety of looks.",
  "category" : "palette",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/9c602a66c3a2d8492389d48adbf2c7fe_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeshadow"
}, {
  "id" : 278,
  "brand" : "pacifica",
  "name" : "Pacifica Radiant Shimmer Highlighting Creams For Eyes Lips Face",
  "price" : "28.0",
  "description" : "You will absolutely LOVE these Radiant Shimmer Coconut Multiples! Coconut infused multi-use creamy colors for cheeks, eyes, lips and even your body are housed in a magically decorated palette. Create shimmering highlights, glowing illumination and beautiful contours. Natural mineral makeup formula blends effortlessly and can be used sheer, layered or built-up for more drama. Go ahead and play all you want, these mineral makeup colors are full of skin-loving naturals.Includes 3 Shimmering Shades:Bronzed: Perfectly glowing sun-kissed color with golden shimmer shadowIsland Rose: shimmering, radiant dewy pink shadowMoonlit: Iridescent pale shades of moon-kissed shimmerFeatures:No animal testingGluten-free100% vegan and cruelty-freeFormulated without: Phthalates, parabens, carmine, beeswax, lanolin, mineral oils, propylene glycol, petroleum and FD& C colors (along with other nasties you do not want on your skin). Ingredients: Ethylhexyl Palmitate, Silica, Mica,  Caprylic/Capric Triglyceride,Helianthus Annuus (Sunflower) Seed Oil, Ozokerite, Copernicia Cerifera(Carnauba) Wax, Euphorbia Cerifera (Candelilla) Wax, Cetyl Palmitate, Carthamus Tinctorius (Safflower) Seedoil, Parfum (All Natural), Tocopheryl Acetate (Vitamin E), Macrocystis Pyrifera (Brown Kelp) Extract,Cocos Nucifera (Coconut) Fruit Extract, Tin Oxide. Titanium Dioxide Ci 77891, Iron Oxides Ci 77941",
  "category" : "powder",
  "rating" : 3.6,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4395f2c09aebd1b8d8f183168bc5d00f_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "blush"
}, {
  "id" : 267,
  "brand" : "covergirl",
  "name" : "CoverGirl Bombshell Powder Brow & Liner in Dark Brown",
  "price" : "9.49",
  "description" : "Bring sexy smolder to eyes & brows.  Soft powder adheres to brows and defines eyes.Features:2-in-1 brow & liner powderVelvety powder fills in browsUse also to softly line & define eyesDirections: Twist open and pull applicator up and tap lightly on tube side to remove excess powder. Lightly brush over eyebrows until desired effect is reached. Also use to softly line & define eyesIngredients: Boron Nitride, Dimethicone, Silica, Polyethylene, Pentylene Glycol, Pumice, Kaolin, Dimethiconol, Phenoxyethanol, Ethylhexylglycerin, Dehydroacetic Acid, Copernicia Cerifera (Carnauba) Wax/Cire De Carnauba, May Contain/Peut Contenir: Titanium Dioxide, Iron Oxides, Mica",
  "category" : "pencil",
  "rating" : 3.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/a7598160bc46504c98c26a241e3047e2_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 260,
  "brand" : "l'oreal",
  "name" : "L'Oreal Infallible Smokissime Powder Eyeliner Pen",
  "price" : "12.99",
  "description" : "Master the smoky eye in one step - really! Every makeup artist knows:  the perfect smoky eye is about the perfect pairing of eyeliner and  shadow. Now, L’Oréal Paris introduces the first smoky eye powder liner,  blending the best of eyeliner and shadow into a single product. Its  Infallible powder formula lasts up to 14 hours while the suede-like  applicator is soft enough to expertly blend, with a pointed tip for  optimal control.",
  "category" : "pencil",
  "rating" : 2.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/08f663a61b796cb57fd6aef86dbb5cc1_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 258,
  "brand" : "milani",
  "name" : "Milani Supreme Kohl Kajal Eyeliner",
  "price" : "8.99",
  "description" : "Milani Supreme Kohl Kajal Eyeliner is perfect for tightlining, waterlining or adding definition to the upper lid - there’s nothing this one-stroke wonder can’t do.  With this sleek gold multi-tasker, you can achieve three distinct looks: 1.To keep it natural, line the upper lid and inner rim.  2. For added drama, thicken the line and extend the tip.  3. Feeling bold? Ring the entire eye. Available in a single stellar shade (Blackest Black), the waterproof formula is laced with hydrating, nourishing ingredients. Features:Smooth-glide application creates three looks from precise to boldSuper long-wear & smudge-proofRetractable tip, no sharpening requiredIdeal for use in waterlineWaterproofApplication: One Product Three Looks: Supremely Natural Supremely Dramatic Supremely Bold (will provide eye images for this section) Apply to upper lashline and inner rim for a natural, precise look. For added intensity, slightly thicken the line and extend the tip. For supreme drama, connect through the lower lashline.Ingredients: Cyclopentasiloxane, Hydrogenated Olive Oil Stearyl Esters, Polyethylene, Polybutene, Silica Silylate, Euphorbia Cerifera (Candelilla) Wax, Octyldodecanol, Cera Microcristallina (Microcrystalline Wax) , Theobroma Grandiflorum (Cocoa) Seed Butter, Sodium Ascorbyl Phosphate, Pentaerythrityl Tetra-di-t-Butyl Hydroxyhydrocinnamate, Tocopherol, Sodium Hyaluronate, Zinc Gluconate, Magnesium Aspartate, Water (Aqua), Copper Gluconate, Mica, Iron Oxide (CI 77499), Black 2 (CI 77266), Ferric Ferrocyanide (CI 77510).",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/0e085149c3fbedd0aa6661c6b3d143cf_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 257,
  "brand" : "annabelle",
  "name" : "Annabelle Retractable Eyeliner",
  "price" : "9.99",
  "description" : "This Annabelle Retractable Eyeliner with integrated sharpener comes in rich, intense colours and  a creamy texture that glides easily. Waterproof and long-lasting formula.                                                                                                                                           Ophthalmologist Tested. Waterproof. 12h wear.                                                                                                  A  must have for a decadent dose of resistant colour!Shade Range:",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/d579558b853bc13b92292106cfc2ed15_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 255,
  "brand" : "cargo cosmetics",
  "name" : "Cargo Cosmetics Swimmables Eye Pencil",
  "price" : "19.0",
  "description" : "Stay in line! Cargo Cosmetics Swimmables Eye Pencil is an ultra creamy, extreme wear, waterproof eyeliner with the feel of a  liquid and versatility of a pencil. Locks comfortably into place for up  to 14 hours. Creamy, transfer-resistant formula glides on effortlessly  to create a variety of looks. Allows for ample blending time before  setting. Concentrated pigments provide rich color payoff. Stays put  through sun, sweat, swim and tears.     Features:  Moisturizing Waterproof PigmentsAvocado and sunflower oil provide a creamy, cushiony texture Durable, budge-proof waxes lock pigments into place for up to 14 hoursLiner tip offers versatile application—from delicate lines to thicker, fuller Ingredients: Isododecane, Synthetic Wax, Hydrogenated Polydicycolpentadiene,  PEG/PPG-18/18 Dimethicone, Polybutene, Glyceryl  Tribehenate/Isostearate/Eicosandioate, Nylon-12, Polyethylene,  Perfluorononyl Dimethicone, Polyglyceryl-4  Diisostearate/Polyhydroxystearate, Sebacate, Synthetic Beeswax,  Tocopherol, Pentaerythrityl Tetra-Di-T-Butyl, Hydroxyhydrocinnamate,  Persea Gratissima (Avocado) Oil, Copernicia Cerifera (Carnauba) Wax,  Helianthus Annuus (Sunflower) Seed Oil, Phytosterols, Olea Europaea  Fruit Oil, Sorbitan Oleat, Ascorbyl Palmitate, Tocopheryl Acetate. May Contain (+/-):   Iron Oxides (CI 77491, CI 77492, CI 77499), Mica (CI 77019), Titanium  Dioxide (CI 77891), Ferric Ferrocyanide (CI 77510), Carmine (CI 75470)",
  "category" : "pencil",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/edee76f18bae96a69164f4058e6b3c32_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 253,
  "brand" : "annabelle",
  "name" : "Annabelle Smudgeliner ",
  "price" : "8.99",
  "description" : "The new definition of smokey eye: edgy, soft, smudgeable! Annabelle Smudgeliners  have a superior long-lasting formula offering rich colour pay-off that  glides on smoothly to create a defined line, or can be easily blended  with the built-in smudger tip to achieve a smokey, sultry look. Its excellent coverage means you can really get creative! Contains natural oxidants and Vitamin E. Mineral-oil free.  Ophthalmologist tested.Shade Range:",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/541b71a4d119bdae25eb1c3690bacf68_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 252,
  "brand" : "mineral fusion",
  "name" : "Mineral Fusion Eye Pencil",
  "price" : "19.0",
  "description" : "Exceptionally rich, the mineral color of Mineral Fusion Eye Pencils glide on smoothly to line, define and enhance eyes. Formulated with Chamomile, Meadowfoam and Vitamin E to soothe delicate skin around eyes. Free of Gluten, Parabens, Artificial Colors, Fragrances and Talc. Never-tested on animals. Hypo-allergenic.Ingredients: Simmondsia Chinensis (Jojoba) Butter, Caprylic/Capric Triglyceride, Limnanthes Alba (Meadowfoam) Seed Oil, Hydrogenated Cottonseed Oil, Mangifera Indica (Mango) Seed Oil, Euphorbia Cerifera (Candelilla) Wax, Glyceryl Caprylate, Copernicia Cerifera (Carnauba) Wax, Macadamia Ternifolia Seed Oil, Tocopherol (Vitamin E), Chamomilla Recutita (Matricaria) Flower Extract, Ascorbyl Palmitate (Vitamin C), Iron Oxides (77491, 77492, 77499), Titanium Dioxide (77891), Mica (77019). Free of Gluten, Parabens, Artificial Colors, Fragrances and Talc. Never-tested on animals. Hypo-allergenic.",
  "category" : "pencil",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/3691e75a871b476e86f1e240ce784e70_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 251,
  "brand" : "wet n wild",
  "name" : "Wet n Wild Sharpen Up! Dual Pencil Sharpener",
  "price" : "1.99",
  "description" : "Specially-designed dual pencil sharpener includes razor-sharp blades to keep pencils of all sizes perfectly-shaped.Features:Dual-purpose sharpener for pencils of all sizesRazor-sharp bladesCompact for easy traveling Directions: Insert pencil into appropriate hole depending on size of pencil and twist.",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/52cb90513c65303b9ac96b0bb8f5e74c_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 248,
  "brand" : "pacifica",
  "name" : "Pacifica Natural Eye Pencil",
  "price" : "16.0",
  "description" : "Pacifica Natural Eye Pencil is a waterproof, buttery smooth eye pencil that glides on easily to avoid pulling on the delicate eye area. Color glides on and stays put for those perfectly defined eyes. Whether it be a very fine line or the ever glamorous cat-eye, these pencils provide the right amount of saturated color to make your eyes pop.Formulated without: Animal ingredients (including carmine, beeswax and  lanolin), animal testing, FD&C colors, mineral oil, parabens,  phthalates, petroleum, propylene glycol, SLS, gluten, peanut oil and  other ingredients you don’t want on your skin.Ingredients: Gun Metal (pewter) - hydrogenated simmondsia chinensis seed oil, mica, caprylic / capric triglycerides, hydrogenated vegetable oil, simmondsia chinensis seed oil, butyrospermum parkii butter, titanium dioxide CI 77891, canola oil, sclerocarya birrea seed oil, iron oxide CI 77499, euphorbia cerifera cera, glyceryl caprylate, copernicia cerifera cera, tocopherol, helianthus annuus seed oil, ascorbyl palmitateBare (Nude) - titanium dioxide CI 77891, hydrogenated simmondsia chinensis seed oil, simmondsia chinensis seed oil, caprylic / capric triglycerides, hydrogenated vegetable oil, mica, butyrospermum parkii butter, canola oil, sclerocarya birrea seed oil, iron oxide CI 77492, euphorbia cerifera cera, glyceryl caprylate, copernicia cerifera cera, iron oxide CI 77491, iron oxide CI 77499, tocopherol, ascorbyl palmitate.Fringe (brown) - hydrogenated simmondsia chinensis seed oil, iron oxide CI 77499, mica, iron oxide CI 77491, iron oxide CI 77492, hydrogenated vegetable oil, caprylic / capric triglyceride, simmondsia chinensis seed oil, butyrospermum parkii butter, canola oil, sclerocarya birrea seed oil, candelilla cerifera cera, glyceryl caprylate, copernicia cerifera cera, tocopherol, helianthus annuus seed oil, ascorbyl palmitate.Jet (black) - iron oxide CI 77499, hydrogenated simmondsia chinenesis seed oil, caprylic / capric triglyceride, simmondsia chinenesis seed oil, hydrogenated vegetable oil, butyrospermum parkii butter, sclerocarya birrea seed oil, mica, candelilla cerifera cera, glyceryl caprylate, copernicia cerifera cera, tocopherol, helianthus annuus seed oil, ascorbyl palmitate",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b2c0bdd88398baadd69b710d27893ca2_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 247,
  "brand" : "covergirl",
  "name" : "CoverGirl Liquiline Blast Eyeliner ",
  "price" : "9.99",
  "description" : "With liquiline blast, you'll get all the intensity and staying power of a  liquid with ease and blendability of a pencil. Use the  liner as-is for intense definition or smoke-it-out with the built-in  smudger end for a subtle, smoky look.Features: Liquid-like formula + the ease of a pencil applicatorSmudger tip lets you customize your intensity",
  "category" : "pencil",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/0e4882c00b6639844d9168d71f43c3ed_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 246,
  "brand" : "annabelle",
  "name" : "Annabelle Smoothliner ",
  "price" : "6.99",
  "description" : "So creamy and smooth it feels like silk on your skin!Annabelle  Smoothliners are  available in a matte or metallic finish and allow for a clean line,  adding depth and elegance to your eyes. Lovely and alluring eyes, all  day long! Waterproof. Long-lasting. Hypo-Allergenic.Shade Range:",
  "category" : "pencil",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/25372c697046520c10607be4c235d3ba_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 244,
  "brand" : "marcelle",
  "name" : "Marcelle Waterproof Eyeliner",
  "price" : "10.99",
  "description" : "Use Marcelle Waterproof Eyeliner for impeccably lined eyes anywhere, anytime! Perfectly blendable, its creamy formula allows for a precise and  intensely coloured line. The smooth texture of this waterproof eyeliner  virtually glides on the skin and stays put all day long, resisting to  water, humidity and heat. Long-lasting, it is nonetheless easily removed  with any Marcelle eye make-up remover. Available in a matte or  pearlized finish.  Hypo-allergenic and perfume free.Shade Range:",
  "category" : "pencil",
  "rating" : 3.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/268575c4edd3108568af16e39ad69517_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 243,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Shimmer Strips Eye Enhancing Eyeliner Trio ",
  "price" : "14.79",
  "description" : "Warm Nude Eyeliner Trio!  The perfect set of earth tone eyeliners to create a Warm Nude look for ANY eye color! Long-wearing, water-resistant and smudge-resistant formula for 24-Hour wear.Tips and Tricks for a Smoky Eye: Apply Eyeliner at the base of upper and lower lash line. Layer shades together for endless looks!Ingredients: Cyclopentasiloxane. Trimethylsiloxysilicate. Polyethylene. Ozokerite.  Lauroyl Lysine. Synthetic Beeswax. Octyldodecanol. Disteardimonium  Hectorite. Propylene Carbonate.  Lecithin. Ascorbyl Palmitate. Citric  Acid. Tocopherol.  May Contain: Iron Oxides. Titanium Dioxide. Mica.  Aluminum Powder. Bismuth Oxychloride. Black 2. Blue 1 Lake. Carmine.  Chromium Hydroxide Green. Chromium Oxide Greens. Ferric Ammonium  Ferrocyanide. Ferric Ferrocyanide. Manganese Violet. Silica. Tin Oxide.  Ultramarines. Yellow 5 Lake.Hypoallergenic. Fragrance-free. Paraben-Free. Gluten Free.   Dermatologist approved. Safe for sensitive eyes and contact lens  wearers.",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b5c7acadc4e472a567e428979d68357c_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 242,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Infallible Silkissime Eyeliner",
  "price" : "11.99",
  "description" : "L'Oréal Paris introduces Silkissime™ by  Infallible® Eyeliner. The formula glides on like silk for a soft and  luxurious line with up to 16H of intensity.Features:  Rich, silky formulaSmudge-resistant, up to 16H wearOphthalmologist testedSuitable for sensitive eyes and contact lens wearers",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/a132f78e0b9e4aa4cca37c9f05267897_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 240,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Extra-Intense Liquid Pencil Eyeliner",
  "price" : "10.99",
  "description" : "Now get the intense look and luxurious feel of a liquid liner with the easy application and precision of a pencil.  Extra-Intense Liquid Pencil Eyeliner glides on smoothly and evenly for beautiful definition in a single stroke.  The smudge-resistant formula provides 16 hours of non-stop wear. ",
  "category" : "pencil",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/cf225e409760daf4dea62290990008a6_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 239,
  "brand" : "covergirl",
  "name" : "CoverGirl Ink it! By Perfect Point Plus Eyeliner",
  "price" : "6.99",
  "description" : "Get inked — without the commitment! Ink It! colors glide on smoothly and  easily without skipping, dragging, or pulling. The bright, bold shades  last all day long.Features: Bright, bold colors for new looks Lasts all day long ­­— no smudging or creasingExpert precision applicationTwist up design",
  "category" : "pencil",
  "rating" : 2.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e4763257a2290da070bd300212d16db8_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 238,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Shimmer Strips Eye Enhancing Eyeliner Trio",
  "price" : "14.79",
  "description" : "Shimmer Strips Custom Eye Enhancing Eyeliner Trio is the perfect set of three eyeliners to enhance your eye colour and provide glamorous definition! Long-wearing, water-resistant and smudge-resistant formula for 24-Hour wear.Directions for Use: Apply eyeliner at the base of upper lashes. Layer shades together for endless looks. For more defined eyes, apply along lower lash line as well.Ingredients: Cyclopentasiloxane. Trimethylsiloxysilicate. Polyethylene. Ozokerite. Lauroyl Lysine. Synthetic Beeswax. Octyldodecanol. Disteardimonium Hectorite. Propylene Carbonate. Lecithin. Ascorbyl Palmitate. Citric Acid. Tocopherol. May Contain: Iron Oxides. Titanium Dioxide. Mica. Aluminum Powder. Bismuth Oxychloride. Black 2. Blue 1 Lake. Carmine. Chromium Hydroxide Green. Chromium Oxide Greens. Ferric Ammonium Ferrocyanide. Ferric Ferrocyanide. Manganese Violet. Silica. Tin Oxide. Ultramarines. Yellow 5 Lake.Hypoallergenic. Fragrance free. Paraben free. Dermatologist approved. Safe for sensitive eyes and contact lens wearers.",
  "category" : "pencil",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4ce7e1ce460841dfc5f42c29221cf5c1_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 237,
  "brand" : "covergirl",
  "name" : "CoverGirl Perfect Point Plus Eyeliner Pencil ",
  "price" : "7.49",
  "description" : "The pencil gives you control and versatility. Want a precise line? It  glides on easily. Want to soften a bit? There's a soft smudger tip. Best  of all? No sharpening necessary, it's got a specially designed  self-sharpener inside. So you always get the point—perfectly.Features: Specially-designed self-sharpenerSoft smudger tip for great blendingGlides on easilyOphthalmologically-tested",
  "category" : "pencil",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/74749bda64dcfe89dfdbf3f2f248cd3a_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 236,
  "brand" : "milani",
  "name" : "Milani Brow & Eye Highlighter Duo Pencil",
  "price" : "6.99",
  "description" : "A versatile two-in-one, this double-ended pencil performs an almost endless array of tasks. Depending on which of our three shade duos you pick, the matte side can be used as an eye shadow base (or shadow itself) and brow highlighter, while the pearl side can brighten up the inner corners of the eyes, and lift and define the brows. Vanilla/Natural Taupe brightens, shapes, and fills in brows. So much brow bang for your buck.Features:Matte side can be used as an eye shadow base and brow highlighterPearl side can brighten up the inner corners of the eyes, and lift and define the browsVanilla/Natural Taupe brightens, shapes and fills browsEasy to useApplication: Use the matte side to enhance and shape the brows, use the pearl side as an instant brow lift and eye brightener. 01 Matte Beige/High Glow:  Both sides can be used underneath the brow bone as a highlighter. Matte Beige can be used as an eyeshadow or eyeshadow base. High Glow can be used in the inner corners of the eyes to brighten. 02 Matte Cream/Luminous Lift:  Both sides can be used underneath the brow bone as a highlighter. Matte Beige can be used as an eyeshadow or eyeshadow base. High Glow can be used in the inner corners of the eyes to brighten. 03 Vanilla/Natural Taupe:  Both sides are matte. Vanilla can be used underneath the brow bone as a highlighter. It can also be used as an eyeshadow or eyeshadow base. Natural Taupe can be used to define and fill-in brows and as an eyeshadow. Ingredients: Isodecyl Isononanoate, Hydrogenated Coco-Glycerides, Euphorbia Cerifera Cera (Candelilla Wax), Cera Microcristallina (Microcrystalline Wax), Polymethyl Methacrylate, Silica, Copernicia Cerifera Cera (Carnauba Wax), Disteardimonium Hectorite, Tocopherol, Propylene Carbonate, Ascorbyl Palmitate, Mica, Titanium Dioxide (CI 77891), Iron Oxide (CI 77491). +/- May Contain: Iron Oxides (CI 77492, CI 77499).",
  "category" : "pencil",
  "rating" : 3.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4c7b17775d8a73cf4585e20761098b79_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 235,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Infallible Never Fail Eye Liner",
  "price" : "12.99",
  "description" : "Enjoy beautifully defined eyes for up to 16 hours! New Infallible Never Fail Eyeliner is L'Oreal's most advanced mechanical liner with superior long-wearing technology. The rich and creamy formula glides on easily and evenly and sets quickly for fade-proof colour. Use the bulit-in smudger and sharper to create versatile eyeliner looks for any occasion.",
  "category" : "pencil",
  "rating" : 3.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/2f7610f4a82cc1c7abb8ddc33ab236f0_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 234,
  "brand" : "sante",
  "name" : "Sante Kajal Eyeliner Pencil",
  "price" : "17.29",
  "description" : "Sante gentle eyeliner pencils have a wonderful texture. They are perfectly suitable  for use on the inner eyelid. Or can be used blended with a sponge to create a  sophisticated effect and make the color last longer.  Vegan and  gluten-free. Not tested on animals.Ingredients: Caprylic/Capric Triglyceride, Ricinus Communis  (Castor) Seed Oil*, Hydrogenated Palm Kernel Glycerides, Copernica  Cerifera (Carnauba) Wax, Hydrogenated Castor O il, Euphorbia Cerifera  (Candelilla) Wax, Cera Alba (Beeswax), Hydrogenated Palm Glycerides,  Ascorbyl Palmitate, Tocopherol, Mica, [+/-CI 77007, CI 77288, CI 77491,  CI 77492, CI 77499, CI 77510, CI 77742, CI 77891]",
  "category" : "pencil",
  "rating" : 3.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/9006e43a8083b3dff963ecbfa02c3707_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 233,
  "brand" : "dr. hauschka",
  "name" : "Dr. Hauschka Kajal Eyeliner",
  "price" : "24.0",
  "description" : "Kajal Eyeliner pencils, highlight and define the beauty of your eyes. Mineral pigments are fused with quince and Japan waxes for smooth, effortless application. Extracts of anthyllis, witch hazel and black tea have a soothing effect on the delicate skin around the eyes. Features:Truly natural and organic cosmetics, certified to NATRUE and/or BDIH standardsFree from chemical/synthetic fragrances and preservativesFree from mineral oils, parabens, silicone and PEGVegan (Kajal Eyeliner 02-05)Dermatologically tested for sensitive skinWherever possible, all raw materials come from controlled organic or Demeter cultivation and are recovered under fair conditions   ",
  "category" : "pencil",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/62462de8cb4b6d0759b9e4b13bc602ed_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 232,
  "brand" : "maybelline",
  "name" : "Maybelline Line Express Eyeliner",
  "price" : "7.29",
  "description" : "Maybelline Line Express Eyeliner's intense color formula + smart tip smudger makes this liner glide on smoothly and is easy to apply with just one stroke.Features: Creamy formula delivers intense colorContour smudger makes blending easyAll-day wearSafe for sensitive eyes and ophthalmologist-testedContact lens safe",
  "category" : "pencil",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4e88f928ad91c88e2ecb8596431ce799_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 231,
  "brand" : "almay",
  "name" : "Almay Intense i-Colour Bring Out Eyeliner",
  "price" : "10.99",
  "description" : "Bring out your eye color with rich contrasting color! This eyeliner softly defines your eyes with a pearlescent color that will make your eye color pop. Comes with a convenient built in sharpener that ensures precise application— and resists smudging and fading throughout the day. Features:   Hypoallergenic Non-irritating Ophthalmologist, Clinically and allergy tested Suitable for contact lens wearers",
  "category" : "pencil",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/384c7e6d20cf4ad138b7120b43a8a310_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 230,
  "brand" : "maybelline",
  "name" : "Maybelline Unstoppable Eyeliner",
  "price" : "8.99",
  "description" : "Unstoppable Eyeliner allows ultra-smooth application for defined lines and eyes. It is a self-sharpening mechanical pencil, and will hold your look in place all day long. Waterproof. Ophthalmologist tested, contact lens safe for sensitive eyes.",
  "category" : "pencil",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/bab89a9fe13b34235e0dd1f4f44c05cf_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 229,
  "brand" : "pure anada",
  "name" : "Pure Anada Pureline Pencil Eye Liner",
  "price" : "14.0",
  "description" : "These natural pencils are made with plant oils and mineral pigments.  If  you prefer a traditional pencil to line your eyes, and want to use a  product with natural ingredients,  try Pure Anada  Pureline eye pencils.Ingredients: Octyldodlecyl Stearoyl Stearate (plant origin), Triglycerides, Hydrogenated Vegetable Oil, Prunus Amygdalus Dulcis (Organic Sweet Almond) Oil, Copernicia Cerifera (Carnauba) Wax, Olus Oil, Candelilla Cera, Mica, Sesamum Indicum (Sesame) Oil, Polyglyceryl-3 Diisostearate, Glyceryl Caprylate, Tocopheryl Acetate, Sorbic Acid, Titanium Dioxide (C.I. 77499), Iron Oxide (C.I. 77891 or 77491) Note:  The ingredients in Pure Anada Pureline Pencils are approved by Eco-cert and/or certified organic.",
  "category" : "pencil",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/4b8ab1da556c57a01854b5bf23016f48_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 228,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Colour Riche Le Khol Eyeliner",
  "price" : "9.29",
  "description" : "L'Oreal Paris Colour Riche Le Khôl Eyeliner comes in a range of beautiful, wearable shades with a luxurious, intense formula  combining oil and wax. This eyeliner softly glides over the  eyelid allowing you to achieve a long-lasting and intense colour result.",
  "category" : "pencil",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/94a08dc5666ab926584801c34140b29e_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 227,
  "brand" : null,
  "name" : "Earth Lab Vegan Mineral Eye Pencil",
  "price" : "18.0",
  "description" : "These natural minerals eye pencils are made fresh to order. They  are super soft, and once they're on they do not run or smudge easily.  That said - they do wash off easily as well!Ingredients: Jojoba Oil, Castor Oil, Carnauba Wax,  Candelillia Wax, Ozokerite Wax, Vitamin E, Mica, and Iron Oxides Mineral pencils expire within 6 months of purchase.",
  "category" : "pencil",
  "rating" : 3.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e43ef102523ce5c38bd92ce1cb562395_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 226,
  "brand" : "revlon",
  "name" : "Revlon ColorStay Eye Liner",
  "price" : "11.49",
  "description" : "ColorStay Eyeliner glides on easily adding drama and definition to your eyes for up to 16 hours. Waterproof formula won't smear, smudge or fade",
  "category" : "pencil",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f8d347e5c094ab100de0f04bc163eb79_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 206,
  "brand" : "wet n wild",
  "name" : "Wet n Wild ProLine Felt Tip Eyeliner",
  "price" : "6.99",
  "description" : "The ProLine Felt Tip Eyeliner is a convenient marker with its soft, felt-tip gives you ultimate control to write on your eyeliner however you'd like. The fine, soft felt-tip glides on easily creating fine or bold lines. Features:Benefits of a liquid liner with the convenience of a penFine, soft felt-tip glides on easilyCreate fine or bold lines for subtle or dramatic results Directions: Start at the inner corners of your eyes and make small strokes following the shape of your eye. For extra drama, extend and thicken at the outer corner of your eyes.Ingredients: Water/Eau, Acrylates Copolymer, Butylene Glycol, Laureth-21, Glycerin, Propylene Glycol, PEG-40 Hydrogenated Castor Oil, Chlorphenesin, Sodium Dehydroacetate, Dipotassium Glycyrrhizate, Trisodium EDTA, Methylisothiazolinone, Black 2/CI 77266.",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/32cde2248ec2fb43fd0b165521965b3f_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 203,
  "brand" : "annabelle",
  "name" : "Annabelle EyeInk2 Mistake Proof Eyeliner + Corrector",
  "price" : "10.99",
  "description" : "Uneven line? No need to whine! This liner's fine felt tip is  designed for ultimate precision and is the perfect tool to achieve a  natural or dramatic look. To correct smudges or unevenness, just flip  the pen around to reveal a magic corrector to erase those little  mistakes as though they never happened! Eyeliner's Key features: Glossy formulaFast dryingLong lasting up to 10H+WaterproofSmudgeproof Corrector's Key features: Gentle and non-greasy formulaRemoves long-wearing and waterproof makeupPerfect for on-the-go touch-ups!",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/8ca9c5677e8b27321069490cc08b3d46_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 201,
  "brand" : "marcelle",
  "name" : "Marcelle Kajal Kohl Eyeliner Blackest Black",
  "price" : "11.99",
  "description" : "Marcelle Kajal Kohl Eyeliner is offered in an ancient  traditional chunky format with a long pointy tip that allows for an  easy, extra-precise application. Plus, it’s waterproof and proven to  last at least 6 hours on the waterline. This antioxidant-enriched,  preservative-free liner is sure to give a daring, seductive look that  lasts and lasts.Hypo-allergenic and perfume free. Paraben free. Tested under ophthalmologic control.",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/bb7368014d95f21e66c99b0f4d5bf91b_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 192,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Shimmer Strips Kohl Kajal Eyeliner Trio ",
  "price" : "14.79",
  "description" : "Physicians Formula's intense and richly pigmented eyeliners are now perfectly paired to create a Nude Look.  Specially developed to line the inner rim of the eyelid, this unique eyeliner form contains a high concentration of pigments for dramatic definition that glides-on effortlessly.Directions: Apply Eyeliner at the base of upper lashes and on inside of lower eye rim for ultra-dramatic definition. Layer shades together for endless looks. Hypoallergenic. Fragrance Free. Paraben Free. Gluten Free. Dermatologist approved. Safe for Sensitive Eyes and Contact Wearers. Ingredients: Hydrogenated Polyisobutene, Beeswax, Caprylic/Capric Glycerides, Synthetic Fluorphlogopite, Silica, Ozokerite, Hydrogenated Coco-Glycerides, Copernicia Cerifera (Carnauba) Wax, Jojoba Esters, Microcrystalline Wax, Aluminum Calcium Sodium Silicate, Dimethicone, Polybutene, Alumina Magnesium Metasilicate, Bisabolol, Calcium Sodium Borosilicate, Caprylyl Glycol, Cetyl Dimethicone, Disteardimonium Hectorite, Panthenyl Ethyl Ether, Tin Oxide, Titanium/Titanium Dioxide, Tocopheryl Acetate, Triethoxycaprylylsilane. May Contain: Aluminum Powder, Bismuth Oxychloride, Carmine, Chromium Oxide Greens, Copper Powder, Ferric Ammonium Ferrocyanide, Ferric Ferrocyanide, Iron Oxides, Manganese Violet, Mica, Titanium Dioxide, Ultramarines, Yellow 5 Lake",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/ac56e10c3ae7d7ec6af4c09ac868831b_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 191,
  "brand" : "zorah",
  "name" : "Zorah Liquid Liner",
  "price" : "24.0",
  "description" : "Zorah Liquid Liner gives you 12 hours of long-lasting intense color, is transfer-free (leaves no trace on crease above the eyelid) and has Pure Light Capture® minerals that deliver color and radiance. Silky lines and refreshingly light, Pure Argan eyeliner leaves a weightless feel on the eyelids.What look do you go for: the natural bronzed babe, tropical brights, or classic beauty? Try all three with this get the look with natural makeup piece found on our blog, The Well! Directions: Lightly trace the lash line. Repeat with a second layer to intensify. Make small dots from the outside working inward. Wait 3 seconds before opening eye so as to avoid streaking. Repeat line if necessary.Ingredients: Aqua, Hydrolyzed Corn Starch, Glyceryl Stearate Citrate, Argania Spinosa Kernel Oil*, Cucurbita Pepo (Pumpkin) Seed Oil*, Glycerin,  Silica, Copernicia Cerifera (Carnauba) Wax*, Hectorite, Sodium Phytate, Sodium Citrate, Benzyl Alcohol, Salicylic Acid, Sorbic Acid, Dehydroacetic Acid. [+/-(peut contenir/may contain) Iron Oxides,Mica, Ultramarines, Bismuth Oxychloride.]Tested dermatologically and ophthalmologically.Certified by Ecocert Greenlife: 98% of the total ingredients are from  natural origin, 5% of total ingredients are from organic farming",
  "category" : "liquid",
  "rating" : 3.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/3dc157e4a7e28f90dbe7e9849ccfc87a_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 189,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Shimmer Strips Kohl Kajal Eyeliner Trio",
  "price" : "14.79",
  "description" : "Physicians Formula Shimmer Strips Kohl Kajal Eyeliner is a Highly  pigmented eyeliner trio that delivers rich color to create a Nude Look  for ANY eye color.Features:   Versatile eyeliner for dramatic definition and inner eye rim intensity     Super- smooth gliding texture makes defining eyes effortless  100% Waterproof wearDirections: Apply eyeliner at the base of upper lashes and on inside of lower eye  rim for ultra-dramatic definition.  Layer shades together for endless  looks.Ingredients: Hydrogenated Polyisobutene, Beeswax, Caprylic/Capric Glycerides, Silica,  Ozokerite, Hydrogenated Coco-Glycerides, Copernicia Cerifera (Carnauba)  Wax, Jojoba Esters, Microcrystalline Wax, Dimethicone, Polybutene,  Alumina Magnesium Metasilicate, Bisabolol, Caprylyl Glycol, Cetyl  Dimethicone, Disteardimonium Hectorite, Panthenyl Ethyl Ether,  Tocopheryl Acetate, Triethoxycaprylylsilane  May Contain:  Aluminum,  Aluminum Calcium Sodium Silicate, Aluminum Powder, Bismuth Oxychloride,  Calcium Sodium Borosilicate, Carmine, Chromium Oxide Greens, Ferric  Ammonium Ferrocyanide, Ferric Ferrocyanide, Iron Oxides, Manganese  Violet, Mica, Synthetic Fluorphlogopite, Tin Oxide, Titanium Dioxide,  Titanium/Titanium Dioxide, Ultramarines, Yellow 5Hypoallergenic. Fragrance-free. Paraben-Free. Gluten Free.   Dermatologist approved. Safe for sensitive eyes and contact lens  wearers.",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/98c26c4923f92c11e36f7dbc28e800a9_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 187,
  "brand" : "suncoat",
  "name" : "Suncoat Sugar-based Natural Liquid Eyeliner",
  "price" : "16.99",
  "description" : "This natural liquid eyeliner is made with natural sugar-based  biopolymer, not synthetic plastics such as PVP (polyvinyl pyrrolidone  polymer) and acrylic copolymer. Colored with earth pigments and enriched  with vitamin E. This is a superior alternative for your sensitive eyes  and our environment!Features: Natural and vegan ingredients, readily biodegradableStays on all day long, will not smear or smudgeKind to sensitive eyesRemove with soap and waterThe wand has a rubber tip instead of hairbrush, much easier to apply. It offers precise control for fine linesIngredients: Aqua  (water), kaolin clay, glycerin, hydrolyzed Zea mays (corn) starch  (natural multi-sugar resin), lecithin, Citrus grandis (grapefruit) seed  extract, tocopherol (vitamin E), citric acid, iron oxides, mica,  titanium dioxide.",
  "category" : "liquid",
  "rating" : 3.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/fffdf1e1c3948940e37d5b304275c0bd_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 186,
  "brand" : "dr. hauschka",
  "name" : "Dr. Hauschka Liquid Eyeliner",
  "price" : "30.0",
  "description" : "The fine brush on the Liquid Eyeliner, available in black, allows for the easy application of a precise and vivid line that is long-lasting and moisturizing to the skin. Eyebright, black tea and neem soothe the delicate skin around the eyes, while rose wax and jojoba oil protect the skin, keeping it silky smooth.Features:Truly natural and organic cosmetics, certified to NATRUE and/or BDIH standardsFree from chemical/synthetic fragrances and preservativesFree from mineral oils, parabens, silicone and PEGDermatologically tested for sensitive skinWherever possible, all raw materials come from controlled organic or Demeter cultivation and are recovered under fair conditionsIngredients (black): Water (Aqua), Alcohol, Sorbitol, Cetearyl Alcohol, Ricinus Communis (Castor) Seed Oil, Bentonite, Camellia Sinensis Leaf Extract, Melia Azadirachta Leaf Extract, Euphrasia Officinalis Extract, Hydrogenated Jojoba Oil, Xanthan Gum, Beeswax (Cera Alba), Rosa Damascena Flower Wax, Rosa Damascena Flower Oil, Fragrance (Parfum), Citronellol*, Geraniol*, Linalool*, Silica, Lysolecithin, Iron Oxides (CI 77499), Titanium Dioxide (CI 77891), Ultramarines (CI 77007).  *component of natural essential oilsIngredients (brown):Water (Aqua), Alcohol, Sorbitol, Cetearyl Alcohol, Ricinus Communis (Castor) Seed Oil, Camellia Sinensis Leaf Extract, Melia Azadirachta Leaf Extract, Bentonite, Euphrasia Officinalis Extract, Hydrogenated Jojoba Oil, Xanthan Gum, Beeswax (Cera Alba), Rosa Damascena Flower Wax, Rosa Damascena Flower Oil, Fragrance (Parfum), Citronellol*, Geraniol*, Linalool*, Maltodextrin, Silica, Lysolecithin, Carmine (CI 75470), Iron Oxides (CI 7749¹, CI 77492, CI 77499).  *component of natural essential oils",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/a16a04e59251404056169188139a9137_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 185,
  "brand" : "almay",
  "name" : "Almay Liquid Liner",
  "price" : "10.99",
  "description" : "Get beautiful definition with this easy-to-use liquid liner. Water-resistant formula lasts up to 16 hours without irritation. Unique \"inkwell\" design delivers fresh liquid liner for each application. Flexible-tip applicator provides mistake-proof control.  Hypoallergenic Non-irritating Ophthalmologist, clinically and allergy tested Suitable for contact lens wearers",
  "category" : "liquid",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/e66b09555d41920597781babffee41dc_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 183,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Intense Ink Eyeliner",
  "price" : "3.99",
  "description" : "e.l.f. Intense Ink Eyeliner quick-dry formula instantly enhances the lash line with rich and long-lasting colour. The felt tip pen allows you to create a sleek or bold line with complete precision. It glides on smoothly without smudging, feathering, or running! How To Use: Apply colour as close to the lash line as possible. For a thin line, use just the point of the pen tip, or slant the pen along the side for a thicker, bolder line Ingredients: Water (Aqua), Styrene/Acrylates/Ammonium Methacrylate Copolymer, Polysorbate 20, Ethyheyl Palmitate, PEG-40 Hydrogenated Castor Oil, Xanthan Gum, Benzyl Alcohol, Methylchloroisothiazolinone. MAY CONTAIN: DC Black #2 (CI 77266).",
  "category" : "liquid",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/805d4c650b7c29c004f7f48d3dc96cb2_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "eyeliner"
}, {
  "id" : 181,
  "brand" : "l'oreal",
  "name" : "L'Oreal Telescopic Explosion Waterproof Eyeliner Black",
  "price" : "12.99",
  "description" : "Now, give your eyes dramatic definition that lasts all day. Telescopic Waterproof precision Liquid Eyeliner is the perfect compagnion to Telescopic Mascara for a precisely defined and intense eye look. The Slanted Precision Felt tip is angled for the most accurate application, and the glide-on formula delivers 16-hour wear thats swim-proof, sweat-proof and smudge-proof  All-day wear Glides on without smudging or smearing Suitable for sensitive eyes and contact lens wearers Fragrance-free Ophthalmologist-tested and allergy-tested   ",
  "category" : "liquid",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/d8a23eb4d183b3b215d46ef39a6e781b_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 180,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Precision Liquid Eyeliner",
  "price" : "4.99",
  "description" : "This long-lasting e.l.f. Studio Precision Liquid Eyeliner formula has pigment rich  color that glides on smoothly for defined and precise lines. Features a  tapered brush design to create thin or bold lines for a custom look. Try  a winged-eyeliner look and unleash your inner retro diva!Ingredients: Water (Aqua), Acrylates Copolymer, Iron Oxides (CI 77491), Black No. 2  (CI 77266), PEG-40 Hydrogenated Castor Oil, Polysorbate 20, Propylene  Glycol, Xanthan Gum, Phenoxyethanol, Methylparaben, Ethylparaben,  Butylparaben, Propylparaben, Isobutylparaben.",
  "category" : "liquid",
  "rating" : 3.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/511628443d092564dafbb56371d62748_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 179,
  "brand" : "maybelline",
  "name" : "Maybelline EyeStudio Master Precise Ink Pen Eyeliner",
  "price" : "11.99",
  "description" : "Experience the new generation of liquid liner from Maybelline!              Ink technology keeps pigments super-saturatedSpring cap keeps the formula freshMost precise line for lasting intensity                                                    Safe for sensitive eyes and ophthalmologist-testedContact lens safeFor Best Results: 1. Start at inner corner of upper eye. Flare outward. 2. Create the sharpest design, uniquely your own.",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6edd2cadd1894a94f264ceb19f3d344b_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 178,
  "brand" : "almay",
  "name" : "Almay Intense i-Colour Play Up Liquid Liner",
  "price" : "10.99",
  "description" : "Play up your eye color with dramatic contrasting color! Define your eyes with bold color. Comes with a precision tip applicator so you can smoothly and easily create a high impact look. Features:   Hypoallergenic non-irritating Ophthalmologist Clinically and allergy tested Suitable for contact lens wearers",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6cf30fccb626b5b1eacc9db7b29dc6c2_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 177,
  "brand" : "maybelline",
  "name" : "Maybelline Line Stiletto Ultimate Precision Liquid Eyeliner",
  "price" : "10.29",
  "description" : "Easily Creates Slender Lines      Rich, Even Color     All-Day Wear     Smooth Glide Felt Tip     Flexible tip guides on smoothly for the most precise control.     All-day wear up to 8 hours",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/350d6c6c2fa3add8ee40189cd19bfe0a_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 176,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Eye Primer & Liner Sealer",
  "price" : "4.99",
  "description" : "Now you can have  your eye makeup lasting longer for no fuss no budge color with this e.l.f. Studio Eye Primer & Liner Sealer.The Prime side sets your eyeshadow in so your color won't fade,  bleed or crease.  The Liner side transforms your favorite eye shadow  into a waterproof, smudge-proof liquid liner with this unique clear  liquid and built-in felt tip precision eyeliner brush. Primer Colour: How to Use: Use the \"prime\" side to create a base for your eyeshadow. Apply to the eyelid and blend in.Use the \"seal\" side and mix your favorite eyeshadow color in with the brush and apply to the lash line as a liner.For best results wipe off and clean applicator before closing.Remove with eye makeup remover.Ingredients:                    Eye Primer Ingredients: Paraffinum  Liquidum (Mineral Oil), Mica, Talc, Bis-Diglyceryl Polyacyladipate-2,  Ozokerite, Euphorbia Cerifera (Candelilla) Wax, Methylisothiazolinone,  Caprylyl Glycol May Contain: Iron Oxides (CI 77491, CI 77492, CI 77499), Titanium  Dioxide (CI 77891)  Liner Sealer Ingredients: Water (Aqua), Acrylates/Octylacrylamide  Copolymer, Propylene Glycol, Benzyl Alcohol,  Methylchloroisothiazolinone, Methylisothiazolinone",
  "category" : "liquid",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/a1fe077c09f5e903412fe2a6c344e115_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 175,
  "brand" : "revlon",
  "name" : "Revlon ColorStay Liquid Eye Liner",
  "price" : "11.49",
  "description" : "Elegant, sexy and sophisticated, ColorStay Liquid Liner allows you to emphasize your eyes with precision. Easy application dries quickly and lasts all day without smudging or smearing. Available in 4 shades.",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/d02f86bc79a8d2f105672d99474300df_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 174,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Lineur Intense Felt Tip Liquid",
  "price" : "10.99",
  "description" : "The one liner that does it all, complete with precision applicator tip. Combines the drama of a liquid with the ease of a pen.",
  "category" : "liquid",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/86cde1cfdb47caee6387cdfc7ac0696e_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 173,
  "brand" : "physicians formula",
  "name" : "Physicians Formula Eye Booster Lash Boosting Eyeliner + Serum",
  "price" : "14.79",
  "description" : "Eye Booster™ 2-in-1 Lash Boosting Eyeliner + Serum's high-tech formula enhances the appearance of lashes while providing the instant definition of a liquid eyeliner, in one easy step! Lash Boosting complex targets the base of lashes where it is most effective. Innovative and easy to use eyelining tool delivers effortless definition. High-tech Japanese formula is long-wearing, water-resistant and smudge-resistant.Directions for Use: Apply eyeliner at the base of lashes in a fine or bold line. Never apply eyeliner inside the lash line. Keep cap tightly closed to prevent formula from drying out.Ingredients: Water. Ethylhexyl Acrylate/Methyl Methacrylate Copolymer. Butylene Glycol. SD Alcohol 40. Beheneth-30. Ammonium Acrylates/Methyl Styrene/Styrene Copolymer. Glycerin. Myristoyl Pentapeptide-17. 1,2-Hexanediol. Acrylates/Octylacrylamide Copolymer. Caprylyl Glycol. Ethylhexylglycerin. Pentylene Glycol. Polyglyceryl-3 Disiloxane Dimethicone. Phenoxyethanol. Sodium Hydroxide. Disodium EDTA. Black 2.Hypoallergenic. Fragrance free. Paraben free. Dermatologist approved. Safe for sensitive eyes and contact lens wearers.",
  "category" : "liquid",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/74826a1dae74e388480d2c8a30f9eb03_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 172,
  "brand" : "maybelline",
  "name" : "Maybelline Liquid Eyeliner",
  "price" : "10.99",
  "description" : "Waterproof Liquid Eyeliner draws intense lining in an instant. It glides on smoothly for even coverage. The firm felt tip applicator allows easy control. Waterproof, all-day wear.",
  "category" : "liquid",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/316d25ac5676470d83612b9391678b0d_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 170,
  "brand" : "maybelline",
  "name" : "Maybelline Eye Studio Lasting Drama Gel Eyeliner",
  "price" : "11.99",
  "description" : "Maybelline Eye Studio Lasting Drama Gel Eyeliner gives you smudge-proof lines that are waterproof for 24 hours. Features:            Oil-free formula holds highly concentrated pigments in a clear gel baseSmudge-proof and waterproof for 24 hoursMost intense line for lasting drama                                                    Safe for sensitive eyes and ophthalmologist-testedContact lens safe   Removes easily with Expert Eyes® Moisturizing Eye Makeup Remover.Maybelline Eye Studio Lasting Drama Gel Eyeliner is one of our 10 Makeup Must Haves.  See the full list on The Well. ",
  "category" : "liquid",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/2054f702d243c286219e0330af836bf5_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "eyeliner"
}, {
  "id" : 169,
  "brand" : "covergirl",
  "name" : "CoverGirl LineExact Liquid Eyeliner ",
  "price" : "7.49",
  "description" : "Compact, easy to hold high precision liquid eyeliner pen has a  smudgeproof, fast-drying formula that glides on to create fine or bold  lines without fuss, for looks that last all day.Features: ExactTip lets you create bold or fine linesCompact, easy-to-holdFast-dryingSmudge-resistant, lasts all daySuitable for sensitive eyes",
  "category" : "liquid",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/f56b44752218960e8ff15d1364510544_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "eyeliner"
}, {
  "id" : 96,
  "brand" : "revlon",
  "name" : "Revlon Ultra HD Lip Lacquer",
  "price" : "10.99",
  "description" : "Lip lacquer goes HD with Revlon's innovative wax-free gel technology. Get true color clarity, vivid high-impact shine and a bouncy, lightweight feel.",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/97f6225468596320404785ab71cb1e02_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 95,
  "brand" : "nyx",
  "name" : "NYX Jumbo Lip Pencil ",
  "price" : "5.99",
  "description" : "NYX Jumbo Lip Pencil is a radiant lip liner that also doubles as a lipstick. NYX Jumbo Lip Pencils infuse lips with alluring, nourishing color, and help you create a perfect pout. Features:Line, define and color with one jumbo pencilFormulated with mineral oil which does not dry out your lipsGoes on smoothly for easy applicationComes in a variety of seductive shades",
  "category" : "lipstick",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6b7a0f4f93839573bf046e149d4927df_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 94,
  "brand" : "cargo cosmetics",
  "name" : "Cargo Cosmetics ColorStick",
  "price" : "32.0",
  "description" : "Cargo Cosmetics ColorSticks are an oil-free, cream colour stick that blends effortlessly to eyes,  cheeks and lips, for a natural, monochromatic look.  The velvety,  ultra-light texture blends flawlessly onto the skin for an “airbrushed”  finish.  Cheeks appear smooth and flawless.  The cream-to-powder formula  sets for an exceptionally longwearing finish and never settles into  fine lines.  The dial-up stick makes application a breeze. Available in 5 shades:  Santorini, Key West and Maui give a natural and  pretty colour to the cheeks, eyes and lips.  St. Tropez offers sheer  bronze glow perfect for giving a soft tan glow or sculpting the  cheekbones.  Champagne is a warm highlighter that is ideal for  highlighting key areas of the face.     Features and Benefits The make-up you’re wearing when you’re not wearing make-upA three-in-one cream-to-powder colour stick for the eyes, lips and cheeks The simplicity of multi-use colour in a convenient dial-up stickA velvety, ultra-light texture that blends flawlessly onto the skin for an “airbrushed” finishThe cream-to-powder formula sets for an exceptionally longwearing finish and never settles into fine linesResults in the ultimate nude glow that seems to come from withinDelivers a glowing finish that is never greasy and exceptionally long lastingOIL-FREEHow to Use: Application is versatile. Apply it directly from the stick, blending  with your fingers or a foundation brush. Or use a brush directly on the  product and then blend with the brush onto your cheeks.Ingredients: Isopropyl Myristate,Mica, Ethylhexyl Palmitate, Isopropyl Stearate,  HDI/Trimethylol Hexyllactone Crosspolymer, Polymethylsilsesquioxane,  Synthetic Wax, CI 77891 (Titanium Dioxide), Ozokerite,  CI 77491 (Iron  Oxides), CI 75470 (Carmine).",
  "category" : "lipstick",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/1855452da6a7fb08fe4154311ccb3369_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 92,
  "brand" : "cargo cosmetics",
  "name" : "Cargo Cosmetics Essential Lip Color",
  "price" : "24.0",
  "description" : "Cargo Cosmetics Essential Lip Color has a smooth, creamy and lightweight formula that offers high pigment  payoff while leaving lips plump and perfectly hydrated throughout the  day. Olive oil, Shea Butter and Jojoba oil provide essential moisture  while plumping peptides offer instant fullness.   Features: Rich Emollients of olive oil, jojoba and shea butter flood lips with  essential moisture, enhancing the feel and wear of the lipstick.Maxi Lip greatly increases lip moisture as it reinforces the  connective tissue of the lips. Instantly lips appear fuller and more  voluminous.Gluten FreeShade Range: Ingredients: Hydrogenated Polyisobutene, Phytosteryl/Isostearyl/Cetyl/Stearyl/Behenyl  Dimer Dilinoleate, Polyethylene, Bis-Diglyceryl Polyacyladipate-2,  Octyldodecanol, Triisostearin, Phenyl Trimethicone, Hydrated Silica,  Squalane, Microcrystalline Wax (Cera Microcristallina), Pentaerythrityl  Tetraisostearate, Ethylhexyl Palmitate, Tribehenin, Sorbitan  Isostearate, Palmitoyl Oligopeptide, Hydrogenated Olive Oil, Olea  Europaea (Olive) Fruit Oil, Olea Europaea (Olive) Oil Unsaponifiables,  Theobroma Cacao (Cocoa) Seed Butter, Simmondsia Chinensis (Jojoba) Seed  Oil, Persea Butyrospermum Parkii (Shea Butter), Gratissima (Avocado)  Oil, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, Tocopheryl  Acetate, Tocopherol, Tetrahexyldecyl Ascorbate, Vp/Eicosene Copolymer,  Vp/Hexadecene Copolymer, Acrylates Copolymer, Polyethylene  Terephthalate, Synthetic Fluorphlogopite, Calcium Sodium Borosilicate,  Calcium Aluminum Borosilicate, Tin Oxide, Silica. May Contain (+/-):  Mica, Titanium Dioxide (Ci 77891), Iron Oxides (Ci 77491, Ci 77492, Ci  77499), Carmine (Ci 75470), Manganese Violet (Ci 77742), Red 6 (Ci  15850), Red 7 Lake (Ci 15850), Red 21 (Ci 45380), Red 27 (Ci 45410), Red  28 Lake (Ci 45410), Red 30 Lake (Ci 77360), Red 33 Lake (Ci 17200),  Orange 5 (Ci 45370), Yellow 5 Lake (Ci 45370), Yellow 6 Lake (Ci 15985),  Blue 1 Lake (Ci 42090).",
  "category" : "lipstick",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5e51a2c8ce9316c8342ac47fdc0ebd1d_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 91,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Colour Riche Collection Exclusive Pure Reds",
  "price" : "10.99",
  "description" : "Inspired by L’Oréal Paris muses, Colour Riche introduces six custom-made, enriching matte red shades tailored to enhance a variety of complexions. Play on a coordinated look by pairing with red nails for an absolute statement.Features:A matte that reveals red's colour intensitySoft intense velvet formulationFormulated with velvet spheres, pure pigments, jojoba oil",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5d0df885cb5721b74b32f64884736ce4_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 90,
  "brand" : "nyx",
  "name" : "NYX Extra Creamy Round Lipstick",
  "price" : "6.99",
  "description" : "NYX Extra Creamy Round Lipstick is the classic, go-to lipstick for all occasions. From Pure Nude to Pink Lyric to Chic Red, Round Lipstick is available in a jaw-dropping variety of shades. Features:Formula offers a velvety textureMineral based to moisturize and condition lipsPigment packed saturated color Long-wearing and smudge resistant Available in a variety of coloursINGREDIENTS: Diisostearyl Malate, Bis-DiglycerylPolyacyladipate-2, Polyglyceryl-2 Triisostearate, Octyldodecanol, IsostearylIsostearate, Ethylhexyl Palmitate, Euphorbia Cerifera (Candelilla) Wax /Euphorbia Cerifera Cera / Cire de Candelilla, Ceresin, Beeswax / Cera Alba /Cire d’abeille, Polyisobutene, Polyethylene, Copernicia Cerifera (Carnauba) Wax/ Copernicia Cerifera Cera / Cire de Carnauba, Microcrystalline Wax / CeraMicrocristallina / Cire Microcristalline, Tocopheryl Acetate, BHA, Limonene,Fragrance / Parfum. MAY CONTAIN / PEUTCONTENIR (+/-): Mica, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491,77492, 77499), Red 6 (CI 15850), Red 7 (CI 15850), Red 28 (CI 45410), Red 36(CI 12085), Blue 1 Lake (CI 42090), Yellow 5 Lake (CI 19140).",
  "category" : "lipstick",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/7e72bc983d7988c6e9b9f35d7703fbe4_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 89,
  "brand" : "maybelline",
  "name" : "Maybelline Color Sensational Rebel Bloom Lipcolour ",
  "price" : "9.99",
  "description" : "Maybelline Color Sensational® Rebel Bloom lipstick offers vivacious pastels in a super-saturated lipcolour. Enjoy the kicky bouquet of lip colors in  pinks, reds and mauves.  Features:Super-saturated pigments take fresh picked pastels to a new bright Never dull, washed out or shy Honey nectar adds a sumptuous feel    Application: Apply lipcolor starting in the center of your upper lip. Work  from the center to the outer edges of your lip, following the contours  of your mouth. Then glide across the entire bottom lip.",
  "category" : "lipstick",
  "rating" : 3.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/fb9e6485500135d94163577da4c3579b_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 87,
  "brand" : "dalish",
  "name" : "DaLish Lipstick Matte Collection",
  "price" : "22.0",
  "description" : "This DaLish Lipstick wows with full coverage, full pigment colour that won’t dry out lips. Inspired by bright, garden blooms, the long lasting, fashion-forward hues endure coffee time or cocktail hour without the ring around your lips. Shade Range: LO1 - Nude Shade – ideal for thick to medium lips.LO2 - Pinky/Red – Has a real punch of colour. For anyone one is willing to be bold!LO3 - Barbie Pink! – It's bright and a fun colour to wear.LO4 - Vintage Ruby Red – This is the original Red lipstick from the 1920’s. It just never goes out of style!LO5 - Soft Coral – It’s a very versatile colour and works well on most.Ingredients: Ricinus Communis (Castor) Seed Oil, Caprylic/Capric Triglycerides, Copernicia Cerifera (Carnauba) Wax, Cetyl Palmitate, Sorbitan Palmitate, Beeswax, Sorbitan Olivate, Cetyl Alcohol, Euphorbia Cerifera (Candelilla) Wax, Hydrogenated Castor oil, Butyrospermum Parkii (shea Butter), Helianthus Annuus (Sunflower) Seed Oil, Rosmarinus officinalis (Rosemary) Leaf Extract, Benzyl Alcohol, Benzoic Acid, Dehydroacetic Acid, Sorbic Acid, Tocopherol, Vanillin, May contain (+/-), Titanium Dioxide CI 77891, Iron Oxides CI 77491, Mica CI 77019, Red 7 Lake CI 15850, Yellow 5 Lake CI 19140, Red 27 Lake CI 45410, Red 30 Lake CI 73360, Blue 1 Lake CI 42090, Carmine CI 75470. *Contains natural Antioxidant *Contains organic castor oil and Carnauba Wax",
  "category" : "lipstick",
  "rating" : 3.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6804e2a3b19200e7a7a67456421763c4_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 86,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Gotta Glow Lip Tint ",
  "price" : "7.99",
  "description" : "This innovative e.l.f. Gotta Glow Lip Tint reacts with the chemistry of your lips to deliver a personalized, perfect shade of pink, berry. or peach! The ethereal hue gives a sheer flush of colour that enhances the natural beauty of your lips. The gel-based formula glides on smoothly and is infused with Shea Butter to moisturize and nourish. How To Use: Apply alone for a natural-looking wash of colour or as a base to any of your favorite e.l.f. lip colours. Repeat application as often as desired.Beauty Tip: Create a flushed glow on the check by applying a little directly to the cheeks and blend out with fingers or a sponge. Ingredients: Octyldodecanol, Hydrogenated Polyisobutene, Isononyl Isononanoate, Polyethylene, Dipentaerythrityl Hexahydroxystearate, Triisodecyl Trimellitate, Diisostearylmalate, Stearyl Dimethicone, Butyrospermum Parkii (Shea) Butter, Euphorbia Cerifera (Candelila) Wax, Synthetic Beeswax, Polymethyl Methacrylate, Stearic Acid, Phenoxyethanol, Tocopheryl Acetate (Ve), Ethylhexylglycerin, Oryza Sativa (Rice) Bran Oil, Pentaerythrityl Tetra-Di-T-Butyl, Hydroxyhydrocinnamate, Propylparaben. MAY CONTAIN: Titanium Dioxide (CI 77891),Red 6 Lake (CI 15850), Red 27 Lake (CI 45410), Red 21 Lake (CI 45380).",
  "category" : "lipstick",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/ec1e1f8ef1fcf76d2fd21d231bbfac7c_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 84,
  "brand" : "l'oreal",
  "name" : "L'Oreal Color Riche Extraordinaire Lip Color",
  "price" : "13.96",
  "description" : "Transform lips from ordinary to extraordinary. Color is richer, lip  surface is smoother and shine is magnified. Formulated with precious  micro-oils and rich color pigments, Extraordinaire provides the ideal  balance of color and care for perfect lips. The unique soft-touch  applicator allows for a silky-smooth, gliding application.Directions: Use the wand to apply starting in the center of your upper lip. Work  from the center to outer edges of your lips, following the contour of  your mouth. Then glide across the entire bottom lip.",
  "category" : "lipstick",
  "rating" : 4.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/739bc21253ce772c2b2e7ad40d9d3f44_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 82,
  "brand" : "wet n wild",
  "name" : "Wet n Wild Silk Finish Lipstick",
  "price" : "1.99",
  "description" : "Wet n Wild lipstick formula contains all the same things as the other guys: rich color, vitamins A & E, aloe vera, and really feels like putting silk on your lips. If you’re already thinking “That is a crazy bargain,” they've now added macadamia nut oil that contains antioxidants to hydrate your lips for a smooth, supple pout. Features:Purse Pride! New improved formula and packaging!Rich, creamy, bulidable color that feels like silk on the lips!Chock-full of nutrients! Enriched with conditioning ingredients of vitamins A & E, aloe vera, and macadamia nut oilIngredients: Ricinus Communis (Castor) Seed Oil, Caprylic/Capric Triglyceride, Cetyl Ethylhexanoate, Ozokerite, Microcrystalline Wax/Cire microcristalline, Ethylhexyl Palmitate, Euphorbia Cerifera (Candelilla) Wax/Cire de candelilla, Ceresin, Diisostearyl Malate, Beeswax/Cire d'abeille, Petrolatum, VP/Hexadecene Copolymer, Copernicia Cerifera (Carnauba) Wax/Cire de carnauba, Pentaerythrityl Adipate/Caprate/Caprylate/Heptanoate, Mineral Oil/Huile minérale, Fragrance/Parfum, Phenoxyethanol, Sorbic Acid, Tocopheryl Acetate, Phytosteryl Macadamiate, Tocopherol, Glycine Soja (Soybean) Oil, Aloe Barbadensis Leaf Extract, Silica, [+/- (MAY CONTAIN/PEUT CONTENIR): Blue 1 Lake/CI 42090, Carmine/CI 75470, Iron Oxides/CI 77491, CI 77492, CI 77499, Mica, Red 21 Lake/CI 45380, Red 27 Lake/CI 45410, Red 30 Lake/CI 73360, Red 40 lake/CI 16035, Red 6/CI 15850, Red 7 Lake/CI 15850, Titanium Dioxide/CI 77891, Yellow 5 Lake/CI 19140, Yellow 6 Lake/CI 15985]",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/31b7ac34f3370824a7d7ed41d21092a3_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 81,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Colour Riche Crystal Shine",
  "price" : "10.99",
  "description" : "Crystal Shine is a spectacular L'Oreal Paris innovation in lip colour that reflects light to perfection!Crystal Shine is brilliance redefined: an explosion of colour that combines the glint of metal with the gleam of crystal. Tiny flakes of crystal are covered by a thick layer of metal and trapped within the rich, moist colour and texture of the lipstick. Crystal Shine technology is contained within Colour Riche's new and improved Tri-Active formula of Vitamins A and E, for long lasting comfort. Colour Riche Crystal Shine is available in 10 stunning shades with crystal reflections-get ready to dazzle!",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6709b779907bbb8410a81c3156ac5a1c_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 80,
  "brand" : "dr. hauschka",
  "name" : "Dr. Hauschka Lipstick ",
  "price" : "34.0",
  "description" : "Dr. Hauschka Lipstick has all the nurturing qualities of their lip care products. Color glides on effortlessly, leaving your lips velvety-smooth.Features: Rose hip and carrot extract keep lips moist and nourishedRose and Jojoba waxes soften and protectColors from nature highlight your natural tonesFurther contour and highlight with Dr.Hauschka LiplinerIngredients: Ricinus Communis (Castor) Seed Oil, Simmondsia Chinensis (Jojoba) Seed  Oil, Rosa Canina Fruit Extract, Lanolin, Beeswax (Cera Alba), Daucus  Carota Sativa (Carrot) Root Extract, Euphorbia Cerifera (Candelilla)  Wax, Copernicia Cerifera (Carnauba) Wax, Rosa Damascena Flower Extract,  Anthyllis Vulneraria Extract, Prunus Amygdalus Dulcis (Sweet Almond)  Oil, Prunus Armeniaca (Apricot) Kernel Oil, Hydrogenated Jojoba Oil,  Rosa Damascena Flower Wax, Fragrance (Parfum), Linalool*, Benzyl  Benzoate*, Farnesol*, Limonene*, Geraniol*, Benzyl Salicylate*,  Eugenol*, Maltodextrin, Lecithin, Silica, Mica, Carmine (CI 75470), Iron  Oxides (CI 77491, CI 77492, CI 77499), Titanium Dioxide (CI 77891)",
  "category" : "lipstick",
  "rating" : 4.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6598776755f921413532606f6db6c8f8_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 79,
  "brand" : "revlon",
  "name" : "Revlon Ultra HD Matte Lipcolor",
  "price" : "10.99",
  "description" : "Revlon Ultra HD Matte Lipcolor gives you lightweight, high definition velvety matte color. It has a moisturizing, velvety  feel with a 100% wax-free, gel formula. Features: Creamy mango and whipped vanilla fragrance  Plush velvety applicator Shade Range: (top row, left to right / bottom row, left to right) Devotion, Obsession, Addiction, Temptation / Flirtation, Love, Seduction, Passion",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/8e5fad1f09c17ff8b312508a2a7da161_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 78,
  "brand" : "l'oreal",
  "name" : "L'Oreal Infallible Lipstick ",
  "price" : "13.99",
  "description" : "L'Oreal Infallible Lipstick is a longwear 2-step lip colour with hyaluronic gel for 24HR triple action.The hyaluron-infused longwear formula provides saturated, vibrant colour for lips that appear smooth and replenished.Features:All day smoothness for colour that never driesAll day hydration for endless comfortAll day resistance for colour that never fades",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/8768b6e9ad0890545f5f261980727caa_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 77,
  "brand" : "revlon",
  "name" : "Revlon ColorStay Ultimate Suede Lipstick",
  "price" : "14.49",
  "description" : "Is your lipstick giving you both moisture  and wear? This velvety soft formula with moisturizing shea butter and  aloe is food proof and doesn’t quit. Apply Revlon ColorStay Ultimate Suede Lipstick once and go!Features: Instant MoistureAll-day Color  Shea butter, Aloe  Soft suede finishApplication Tips: Apply your favorite shade of Revlon  ColorStay Ultimate Suede onto clean, smooth lips. Make a statement with a  modern matte finish. Revlon ColorStay Ultimate Suede can be worn with  or without a Lipliner.",
  "category" : "lipstick",
  "rating" : 3.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6ca3ee39a1dde0039b18d0ebdb7c2603_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 74,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Colour Riche Collection Exclusive Lip Colour ",
  "price" : "10.99",
  "description" : "L'Oreal Paris Collection Exclusive by Colour Riche® introduces a permanent offer to  the L'Oreal Paris portfolio. This collection includes six signature nude shades by L'Oreal's six  dazzling spokeswomen. The shades are custom-made to match various skin tones and  haircolour.",
  "category" : "lipstick",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/a9c19212339fb2ed792af559b2a4208d_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 73,
  "brand" : "maybelline",
  "name" : "Maybelline Color Sensational The Buffs Lipcolour",
  "price" : "9.99",
  "description" : "Raw. Real. Pigments explode with sensuous impact…sensational! Maybelline Color Sensational The Buffs Lipcolour have true nude lip color pigments for honest flesh tone color. This range has it all, from blushing beige, to bronze, to espresso.   For Best Results: Apply your nude lip color lipstick by starting in the center  of your upper lip. Work from the center to the outer edges of your lip,  following the contours of your mouth. Then glide across the entire  bottom lipShade Range:",
  "category" : "lipstick",
  "rating" : 4.8,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/27afa69db661563a1d6135bb5f6079dd_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 72,
  "brand" : "maybelline",
  "name" : "Maybelline Color Sensational Vivids Lipcolour",
  "price" : "9.99",
  "description" : "With Maybelline Colour Sensational Vivids Lipcolour bright goes gorgeous, never garish!Get brighter color from Maybelline's exclusive vivid pigments.﻿ Plus get creamier feel from nourishing honey nectar.﻿ Features: Be bright and gorgeousExclusive Vivid colors are brighterHoney nectar formula nourishes lips﻿For Best Results: Apply lipcolor starting in the center of your upper lip. Work from the center to the outer edges of your lip, following the contours of your mouth. Then glide across the entire bottom lip.﻿Shade Range:",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/0d31f41c37fd18dfc02daa1671719378_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 71,
  "brand" : "pacifica",
  "name" : "Pacifica Devocean Natural Lipstick Deeply Devoted Creamy Color",
  "price" : "21.0",
  "description" : "Pacifica Devocean Lipstick is a 100% natural, hydrating vegan lipstick that will last with intensity, like the deepest of love.What look do you go for: the natural bronzed babe, tropical brights, or classic beauty? Try all three with this get the look with natural makeup piece found on our blog, The Well! Formulated without: Animal ingredients (including carmine,  beeswax and lanolin), animal testing. FD & C colors, mineral oil,  parabens, phthalates, petroleum, propylene glycol, SLS, gluten, peanut  oil and other ingredients you don't want on your skin.",
  "category" : "lipstick",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/54eca0da1259fdc4eed0346e6fdcb590_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 70,
  "brand" : "burt's bees",
  "name" : "Burt's Bees Lipstick ",
  "price" : "9.99",
  "description" : "Burt's Bees Lipstick provides luscious, full-coverage color and hours of natural moisture.Features:Moisturizing Satin-finish shades Creamy and lightweight feel, ideal for everyday wear 100% Natural with 100% recyclable materialDirections: Remove lid, apply to lips for your desired level of satin colorIngredients: diheptyl succinate, capryloyl glycerin/sebacic acid copolymer, ricinus communis, helianthus annuus, cera alba, candelilla cera , behenyl alcohol, oleic/linoleic/linolenic polyglycerides, C12-18 acid triglyceride, lanolin hydrogenated vegetable oil, cera carnauba [copernicia cerifera (carnauba) wax], moringa oleifera seed oil rubus idaeus (raspberry) seed.",
  "category" : "lipstick",
  "rating" : 3.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/cffae93a3ef7d0c543b36a74684735ad_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 69,
  "brand" : "maybelline",
  "name" : "Maybelline Color Sensational Creamy Mattes Lipcolour ",
  "price" : "9.99",
  "description" : "Maybelline Creamy Mattes by Color Sensational deliver a burst of bold lip color and a surge of creamy texture in great make-a-statement shades, for mattes your lips will love to wear!Features: Lips slip into this creamy matteMattifying cream pure pigments and three precious oilsMake-a-statement shades",
  "category" : "lipstick",
  "rating" : 5.0,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/81fd80f898674d00f1860cd0724460f4_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 68,
  "brand" : "l'oreal",
  "name" : "L'Oreal Paris Colour Riche Lipstick",
  "price" : "10.99",
  "description" : "Indulge in richness beyond compare with L'Oreal's most luxuriously rich color and intensely rich hydration. Colour Riche®  Lipcolour is richer, creamier and more moisturizing than ever before.  In addition to nourishing ingredients like Omega 3 and Vitamin E, the  formula is enriched with Argan Oil to condition and soften lips. Your  lips are kept soft, smooth, and ultra-hydrated. With a spectrum of  gorgeous shades from bold to nearly nude, Colour Riche® Lipcolour offers a shade that’s perfect for every look and any occasion.",
  "category" : "lipstick",
  "rating" : 4.6,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5409595e1888807b979036e77ef7e496_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 67,
  "brand" : "revlon",
  "name" : "Revlon Matte Lipstick",
  "price" : "11.79",
  "description" : "Straight from the Runway shades ! Beautifully rich matte color glides effortlessly across lips. Suede-like, cushiony feel and with maximum color impact. Beautifully rich shades from nude to deepest berry.",
  "category" : "lipstick",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/ee024f34ca91f5fa1358d47284f07fb0_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 66,
  "brand" : "revlon",
  "name" : "Revlon ColorStay Ultimate Liquid Lipstick",
  "price" : "14.49",
  "description" : "Revlon ColorStay Ultimate Liquid Lipstick is a one-step, food-proof lipcolor with a patented ColorStay technology that lasts up to 24 hours.Features:Food-proof lipcolor with a built-in, ultra-conditioning topcoatOne-step application- No topcoat required for comfortable wearStays comfortable and wears beautifullyDoes not feather or fade; no touch-ups required, even after meals    To Use: Apply a thin, even layer to clean, bare lips and wait until dry.",
  "category" : "lipstick",
  "rating" : 4.1,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6750098db06175dee7493eca3f711fc3_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 65,
  "brand" : "maybelline",
  "name" : "Maybelline Color Sensational Lipcolour",
  "price" : "9.99",
  "description" : "Maybelline Colour Sensational Lipcolour will make you fall in love with color, all over again! Features:   Crisper color from pure pigments  Creamier feel from nourishing honey nectar  Lipcolor so rich, so stunning… it’s sensational Incredible colour range, from pinks, plums, reds and bronze   ",
  "category" : "lipstick",
  "rating" : 4.2,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b1c627d5a7e341e53754c8dee92d2878_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 64,
  "brand" : "nyx",
  "name" : "NYX Soft Matte Lip Cream",
  "price" : "8.99",
  "description" : "Neither lipstick nor lip gloss this NYX Soft Matte Lip Cream is a new kind of lip color that goes on silky smooth and sets to a matte finish. Features:Soft Matte Lip Cream is durableUnlike some matte lipstick formulas this lip cream is moisturizing and does not dry outComes in a variety of shades for every occasionLong wearing, high pigmentation Ingredients: Pentaerythrityl Tetraisostearate, Dimethicone,Beeswax, Glyceryl Behenate / Eicosadioate, Phenoxyethanol, Dimethicone /Dimethicone Crosspolymer, Talc, Methyl Methacrylate Crosspolymer, Silica, Aluminium Starch Octenylsuccinate, Isohexadecane,Disteardimonium Hectorite, Propylene Carbonate, Parfum. MAY CONTAIN / PEUT CONTENIR (+/-):CI77019 (Mica) / CI77891 (Titanium Dioxide), CI15850 (D&C Red 6 Na.Salt), CI15850 (D&C Red 7 Ca Lake), CI15985:1 (FD&C Yellow 6 AlLake), CI19140:1 (FD&C Yellow 5 Al Lake), CI45410 (D&C Red 28 AlLake), CI77491 (Iron Oxide Red), CI77492 (Iron Oxide Yellow), CI77499(Iron Oxide Black), CI77742 (Manganese Violet), CI77891 (TitaniumDioxide).",
  "category" : "lipstick",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/1dd732e9af6067d5adb4b3b1ba4a4f8c_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 62,
  "brand" : "burt's bees",
  "name" : "Burt's Bees Lip Crayon",
  "price" : "9.99",
  "description" : "Try Burt's Bees Lip Crayons and enjoy the 100% natural creamy matte colour with moisture-rich wear. These lightweight jumbo lip pencils moisturize for a comfortable, everyday wear with a formula infused with Shea Butter, Kendi Oil, and Jojoba  Oil. It's colour that truly cares for your lips!What look do you go for: the natural bronzed babe, tropical brights, or classic beauty? Try all three with this get the look with natural makeup found on our blog, The Well! Features:   Creamy matte color and moisture-rich wear For everyday wear either alone or layered under a Lip Gloss or Lip Shine Precise application in a playful form without the hassle and mess of sharpening No added flavor or fragrance Hydrates and moisturizes lips, leaving them feeling soft and smoothShades: Ingredients: ricinus communis (castor) seed oil, caprylic/capric triglyceride, simmondsia chinensis (jojoba) seed oil, candelilla cera (euphorbia cerifera wax, cire de candelilla), cera alba (beeswax, cire d'abeille), cera carnauba (copernicia cerifera wax, cire de carnauba), butyrospermum parkii (shea) butter, hydrogenated vegetable oil, aleurites moluccana seed oil*, olea europaea (olive) fruit oil, helianthus annuus (sunflower) seed oil, rosmarinus officinalis (rosemary) leaf extract, tocopherol, lecithin, silica, glycine soja (soybean) oil. +/- (May contain / Peut contenir): CI 77891 (titanium dioxide), CI 77019 (mica), CI 75470 (carmine), CI 77491, CI 77492, CI 77499 (iron oxides) *kendi oil",
  "category" : "lipstick",
  "rating" : 4.5,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/ab45997fcda6fc649959ea74507c28e3_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 61,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Matte Lip Color",
  "price" : "4.99",
  "description" : "This convenient jumbo sized lip pencil creates exact color application  with twist up ease so you never have to sharpen.  The pigment rich color  glides on effortlessly and easily to provide long lasting matte color.   The enriched Vitamin A, C & E formula moisturizes and hydrates lips  for beautiful healthy looking lips.How To Use: Apply to lips and blend in color. Re-apply as often as desired. Use alone or layer with your favorite lip gloss shade for a glossy effect. Ingredients: Paraffinum Liquidum (Mineral Oil), Microcrystalline Wax (Cera  Microcristallina), Synthetic Beeswax，Ethylhexyl Palmitate, Copernicia  Cerifera (Carnauba) Wax, Ozokerite, Polyethylene, Ceresin, Silica  Dimethyl Silylate, Polyisobutene, Aspartame, Retinol (VA), Magnesium  Ascorbyl Phosphate (VC), Tocopheryl Acetate (VE), Phenoxyethanol,  Ethylparaben，Propylparaben, Methylparaben. May Contain：Titanium Dioxide  (CI 77891), Iron Oxides (CI 77491, CI 77492,CI 77499), Blue No.1 Lake (  CI 42090), Red No.40 Lake (CI 16035), Red No.7 Lake (CI 15850), Red  No.27 Lake (CI 45410)",
  "category" : "lipstick",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5f81d4f36c4ba153bcc62e81bc93573f_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 60,
  "brand" : "revlon",
  "name" : "Revlon Super Lustrous Lipstick",
  "price" : "11.49",
  "description" : "Revlon Super Lustrous Lipstick is as essential as the little black dress. With a tonne of fabulous, fashionable shades, Super Lustrous Lipstick offers the widest range of colors, so you are sure to find one that looks gorgeous on you! Packed with mega-moisturizers and vitamins C and E for soft, smooth, sexy lips. Your lips stay kissably conditioned for lasting smoothness while the color stays rich and true.",
  "category" : "lipstick",
  "rating" : 4.9,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/6618c0f47d043084550818a74e6250aa_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 59,
  "brand" : "milani",
  "name" : "Milani Color Statement Moisture Matte Lipstick",
  "price" : "6.99",
  "description" : "Inspired by the Milan Runway, eight new matte shades and two luscious crème shades.Features:One stroke, full coverage applicationLightweight & creamy formulaInfused with Vitamins A & C to hydrate lipsLong-wearing formula Colour-true finishApplication: Begin applying from the center of your upper lips and work your way to the outer edges. Same application is used for your bottom lips. Tip: Lipliner helps extend the wear & keeps your lipstick from feathering.   When choosing a lipliner shade, match the lipliner to your lipstick shade or match your lipliner to the shade of your lips which will work with all your lipstick shades.   Create a custom lipcolor by using a contrasting lipliner and lipstick shade.Ingredients: Ricinus Communis (Castor) Seed Oil, Tridecyl Trimellitate, Euphorbia Cerifera (Candelilla) Wax / Euphorbia Cerifera Cera, Ethylhexyl Palmitate, Microcristallina Cera (Microcrystalline Wax), Cera Alba (Beeswax), Ozokerite, Copernicia Cerifera (Carnauba) Wax/Cera Carnauba, Benzyl Benzoate, Fragrance (Parfum), Vanillin, Ascorbyl Palmitate, Tocopherol, Glycine Soja (Soybean) Oil, Retinyl Palmitate, Hydroxycitronellal. +/- May Contain: Mica, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Red 6 (CI 15850), Red 7 (CI 15850), Red 22 (CI 45380), Red 27 (CI 45410), Red 28 (CI 45410), Yellow 5 (CI 19140), Yellow 6 (CI 15985), Blue 1 (CI 42090), Carmine (CI 75470).",
  "category" : "lipstick",
  "rating" : 4.7,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/a782e8566462ce85fbf46a791f0004e5_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 58,
  "brand" : "milani",
  "name" : "Milani Color Statement Lipstick",
  "price" : "6.99",
  "description" : "Inspired by the Milan Runway, eight new matte shades and two luscious crème shades.Features:One stroke, full coverage applicationLightweight & creamy formulaInfused with Vitamins A & C to hydrate lipsLong-wearing formula Colour-true finishApplication: Begin applying from the center of your upper lips and work your way to the outer edges. Same application is used for your bottom lips. Tip: Lipliner helps extend the wear & keeps your lipstick from feathering.   When choosing a lipliner shade, match the lipliner to your lipstick shade or match your lipliner to the shade of your lips which will work with all your lipstick shades.   Create a custom lipcolor by using a contrasting lipliner and lipstick shadeIngredients: Ricinus Communis (Castor) Seed Oil, Tridecyl Trimellitate, Euphorbia Cerifera (Candelilla) Wax / Euphorbia Cerifera Cera, Ethylhexyl Palmitate, Microcristallina Cera (Microcrystalline Wax), Cera Alba (Beeswax), Ozokerite, Copernicia Cerifera (Carnauba) Wax/Cera Carnauba, Benzyl Benzoate, Fragrance (Parfum), Vanillin, Ascorbyl Palmitate, Tocopherol, Glycine Soja (Soybean) Oil, Retinyl Palmitate, Hydroxycitronellal. +/- May Contain: Mica, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Red 6 (CI 15850), Red 7 (CI 15850), Red 22 (CI 45380), Red 27 (CI 45410), Red 28 (CI 45410), Yellow 5 (CI 19140), Yellow 6 (CI 15985), Blue 1 (CI 42090), Carmine (CI 75470).",
  "category" : "lipstick",
  "rating" : 4.4,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/5adaa808a071d0f63933cb75fa9a1dfc_ra,w158,h184_pa,w158,h184.png",
  "product_type" : "lipstick"
}, {
  "id" : 57,
  "brand" : "revlon",
  "name" : "Revlon ColorBurst Matte Balm ",
  "price" : "11.49",
  "description" : "Revlon ColorBurst Matte Balm offers velvety color with balm-like moisture!Packaged in an adorable chubby crayon, this Matte balm is infused with a Triple Butter Complex of Shea, Mango and  Coconut Butter.",
  "category" : "lipstick",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/76076d06ebd517f1ae7e359d96d50b32_ra,w158,h184_pa,w158,h184.jpg",
  "product_type" : "lipstick"
}, {
  "id" : 56,
  "brand" : "e.l.f.",
  "name" : "e.l.f. Studio Moisturizing Lipstick",
  "price" : "4.99",
  "description" : "The velvety, satin texture of e.l.f. Studio Moisturizing Lipstick glides on lips with vibrant color and  luminous shine. Enriched with Shea and Vitamins A, C, & E to nourish  and hydrate the lips. The rich, creamy formula seals in moisture for  long-lasting wear and comfort.Ingredients: Paraffinum Liquidum (Mineral Oil), Petrolatum, Ceresin, Ethylhexyl Palmitate, Hydrogenated Polydecene, Microcrystalline Wax (Cera Microcristallina), Polybutene, Paraffin, Synthetic Beeswax, Polyethylene, Copernicia Cerifera (Carnauba) Wax, Silica Dimethyl Silylate, Fragrance (Parfum), Butyrospermum Parkii (Shea) Butter, Retinyl Palmitate (Va), Tocopheryl Acetate (Ve), Ascorbyl Palmitate (Vc), Neotame, Propylparaben May Contain: Mica, Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77492, CI 77499), Red 40 Lake (CI 16035), Red 7 Lake (CI 15850), Red 27 Lake (CI 45410), Red 6 Lake (CI 15850), Yellow 5 Lake (CI 19140), Blue 1 Lake (CI 42090)",
  "category" : "lipstick",
  "rating" : 4.1,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/9e370b087244262131cab9db8b6725c7_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}, {
  "id" : 55,
  "brand" : "pure anada",
  "name" : "Pure Anada Petal Perfect Lipstick",
  "price" : "14.0",
  "description" : "Pure Anada Petal Perfect Lipstick is a moisture intensive natural lipstick. Made with rich butters, plant oils, and waxes provide a smooth, creamy consistency. For a boost of shine, apply the coordinating Pure Anada Lip Gloss on top of your lipstick.Pure Anada Petal Perfect Lipstick is made with certified organic Rosehip Seed Oil which is known to repair dry, damaged skin and promote cell regeneration.  A perfect treatment to hydrate and smooth your lips!A berry-toned lip is a must have for the cool fall season and carries on great through the winter! Find more green fall beauty essentials on our blog, The Well.Shades: Ingredients: Ricinus Communis (Organic Castor Seed Oil), Rosa Canina (Organic Rosehip Seed Oil), Simmondsia Chinensis (Organic, cold pressed Jojoba Seed Oil), Butyrospermum Parkii Fruit (Unrefined, Organic, Shea Butter), Limnanthes Alba (Organic Meadowfoam Seed Oil), Euphorbia Cerifera(Candelilla Wax), Copernicia Cerifera(Carnauba) Wax, Mica, Iron Oxides, Tocopherol (Vitamin E), Citrus Tangerina (Organic Tangerine Essential Oil)Vegan, Gluten Free, Non-GMO, Dairy Free, Peanut Free, Natural",
  "category" : "lipstick",
  "rating" : 4.3,
  "image_link" : "https://d3t32hsnjxo7q6.cloudfront.net/i/b66c56aeb8d078123cca4c9c64d17cb9_ra,w158,h184_pa,w158,h184.jpeg",
  "product_type" : "lipstick"
}]